{
  "name": "characters",
  "description": "Wuthering Waves Characters Dataset",
  "version": "1.0.24",
  "latestAdd": { "name": "Rover (Havoc)", "id": 18 },
  "data": [
    {
      "id": 2,
      "name": "Aalto",
      "rarity": 4,
      "attribute": "Aero",
      "weapon": "Pistols",
      "profile": {
        "info": "Aalto is an enigmatic Information Broker, known for his elusive nature and welcoming smile. Rumor has it he'll provide any information at the right price.",
        "gender": "Male",
        "birthplace": "New Federation",
        "affiliation": "The Black Shores"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Half Truths",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Aalto fires up to 5 consecutive shots, dealing Aero DMG. Basic Attack 4 will spread the \"Mist\" forward, which lasts for 1.5s.",
            "Heavy Attack": "Aalto enters the aiming state for a more powerful shot. The aimed shot fired after charging finishes deals Aero DMG.",
            "Mid-air Attack": "Aalto consumes STA to perform consecutive shots at the target in mid-air, dealing Aero DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Aero DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Misty Cover",
          "skillDesc": "When Aalto passes through \"Mist\" or \"Gate of Quandary\", he enters the Mistcloak Dash.",
          "skillVars": {
            "Mistcloak Dash": "- Movement speed increased;\n- During this period, \"Mist Drops\" are continuously consumed, and for each 1 \"Mist Drop\" consumed, 1 Mist Bullet(s) is generated.",
            "Mist Drops": "Aalto can hold to 6 \"Mist Drops\". When Basic Attack or Mid-air Attack passes through \"Mist\" and hits the target, 1 \"Mist Drop\" is recovered."
          }
        },
        "Resonance Skill": {
          "skillName": "Shift Trick",
          "skillDesc": "",
          "skillVars": {
            "Mist Avatar": "Casts \"Mist\" and 1 \"Mist Avatar(s)\" to taunt the surrounding targets. The avatars inherit a portion of Aalto's HP and generate 6 Mist Bullets around them, dealing Aero DMG.",
            "Mist Bullets": "Deals Aero DMG, considered as Resonance Skill damage."
          }
        },
        "Resonance Liberation": {
          "skillName": "Flower in the Mist",
          "skillDesc": "Generate a \"Gate of Quandary\" in front, dealing Aero DMG. When bullets pass through the \"Gate of Quandary\", they deal increased DMG. \"Gate of Quandary\" lasts for 10s.",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Feint Shot",
          "skillDesc": "Aalto shows up out of thin air to perform rapid continuous shooting, dealing Aero DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Dissolving Mist",
          "skillDesc": "The incoming character (or a character on a nearby team that activates an Outro Skill) has their Aero DMG Amplified by 23% for 14s or until they are switched off field.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Perfect Performance",
          "skillDesc": "Aalto's Heavy Attack will always critically hit, triggered once every 30s.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Mid-game Break",
          "skillDesc": "Aalto will continuously recover STA when he is in the Forte Circuit Mistcloak Dash state.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "aalto_icon.png",
        "portrait": "aalto_portrait.png"
      }
    },
    {
      "id": 3,
      "name": "Baizhi",
      "rarity": 4,
      "attribute": "Glacio",
      "weapon": "Rectifier",
      "profile": {
        "info": "Baizhi is a researcher in Remnant Ecoacoustics.\n\nBaizhi's once unfulfilled wish has now manifested as her loyal companion. The remnant Creature You'tan is her source of healing powers, and a lifelong research focus.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Destined Promise",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Baizhi instructs You'tan to perform up to 4 consecutive attacks, dealing Glacio DMG.",
            "Heavy Attack": "Baizhi continuously consumes STA to command You'tan to attack enemies, dealing Glacio DMG. During Heavy Attack, Baizhi can command You'tan to move.",
            "Mid-air Attack": "Baizhi consumes STA and summons You'tan in mid-air to perform a Plunging Attack, dealing Glacio DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Glacio DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Cycle of Life",
          "skillDesc": "",
          "skillVars": {
            "You'tan": "A Remnant Creature that answers to Baizhi's mind and desires while sharing all her stats. You'tan goes back to Baizhi when Baizhi dodges.",
            "Concentration": "Baizhi consumes all \"Concentrations\" when casting Heavy Attack or Resonance Skill Emergency Plan to continuously heal all characters on nearby teams. Each 1 \"Concentration\" consumed provides 1 healing. The healings happens every 2s.\n\nWhen Baizhi consumes \"Concentration\" to cast Heavy Attack, Baizhi additionally restores Concerto Energy and Resonance Energy;\n\nWhen Baizhi consumes \"Concentration\" to cast Resonance Skill Emergency Plan, Baizhi additionally restores Concerto Energy.",
            "Forte Gauge: Concentration": "Baizhi can hold up to 4 \"Concentrations\". Baizhi obtains 1 \"Concentration\" for every Basic Attack on hit."
          }
        },
        "Resonance Skill": {
          "skillName": "Emergency Plan",
          "skillDesc": "Baizhi calls You'tan to attack the target, dealing Glacio DMG while immediately healing all characters on nearby teams.",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Momentary Union",
          "skillDesc": "Baizhi summons You'tan to heal all characters on nearby teams, generating 4 stacks of Remnant Entities.",
          "skillVars": {
            "Remnant Entities": "Remnant Entities follow the active team members. 1 stack of Remnant Entities is automatically consumed to attack the targets every 2.5s, dealing Glacio DMG on hit while healing the active character on a nearby team."
          }
        },
        "Intro Skill": {
          "skillName": "Overflowing Frost",
          "skillDesc": "Baizhi calls You'tan to perform 1 plunging attack, dealing Glacio DMG while healing all characters on a nearby team.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Rejuvenating Flow",
          "skillDesc": "Baizhi heals the incoming character (or a character on a nearby team that activates an Outro Skill) by 1.54% of her Max HP every 3s for 30s. The healed character(s) also have their All-Type DMG Amplified by 15% for 6s.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Harmonic Range",
          "skillDesc": "When Baizhi casts Resonance Skill Emergency Plan, You'tan generates a field of Euphonia that lasts 15s.",
          "skillVars": {
            "Euphonia": "ATK of the Resonators who pick up Euphonia is increased by 15% for 20s."
          }
        },
        "Inherent Skill 2": {
          "skillName": "Stimulus Feedback",
          "skillDesc": "Baizhi's Heavy Attack on hit heals the character with the lowest HP on a nearby team by 0.25% of her Max HP.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "baizhi_icon.png",
        "portrait": "baizhi_portrait.png"
      }
    },
    {
      "id": 4,
      "name": "Calcharo",
      "rarity": 5,
      "attribute": "Electro",
      "weapon": "Broadblade",
      "profile": {
        "info": "Leader of the \"Ghost Hounds\", an international mercenary group. Ruthless, vengeful, unforgiving. A potential client must be mindful of the price to pay before making him an offer.",
        "gender": "Male",
        "birthplace": "New Federation",
        "affiliation": "Ghost Hounds"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Gnawing Fangs",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Calcharo performs up to 4 consecutive attacks, dealing Electro DMG.",
            "Heavy Attack": "Consumes STA to attack the target, dealing Electro DMG.",
            "Mid-air Attack": "Consumes STA to perform a Mid-Air Plunging Attack, dealing Electro DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Electro DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Hunting Mission",
          "skillDesc": "",
          "skillVars": {
            "Heavy Attack: \"Mercy\"": "When Calcharo has 3 \"Cruelty\", his Heavy Attack is replaced with Heavy Attack \"Mercy\". When casting Heavy Attack \"Mercy\", Calcharo consumes 3 \"Cruelty\" to deal Electro DMG, considered as Heavy Attack damage, and recovers Resonance Energy and Concerto Energy.",
            "\"Cruelty\"": "Calcharo can hold up to 3 \"Cruelty\". Under Resonance Liberation Deathblade Gears state, \"Cruelty\" cannot be acquired. When Resonance Skill Extermination Order hits the target, gain 1 \"Cruelty\".",
            "Heavy Attack: \"Death Messenger\"": "When Calcharo has 5 \"Killing Intent\", his Basic Attack is replaced with Heavy Attack \"Death Messenger\". When casting Heavy Attack \"Death Messenger\", Calcharo consumes 5 \"Killing Intent\" to deal Electro DMG, considered as Resonance Liberation damage, and recovers Resonance Energy and Concerto Energy.",
            "\"Killing Intent\"": "Under Resonance Liberation Deathblade Gear state, Calcharo's Forte Gauge is replaced with \"Killing Intent\", stacking up to 5. When Basic Attack Hounds Roar hits the target, Calcharo gains 1 \"Killing Intent\"."
          }
        },
        "Resonance Skill": {
          "skillName": "Extermination Order",
          "skillDesc": "Calcharo performs up to 3 consecutive attacks, dealing Electro DMG.\n\nIf Calcharo is switched off field, or if Resonance Skill Extermination Order is not activated again in a while, this skill will enter Cooldown.\n\nResonance Skill Extermination Order does not interrupt Calcharo's Basic Attack cycle.",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Phantom Etching",
          "skillDesc": "Calcharo attacks the target, dealing Electro DMG and enters Deathblade Gear state. After Deathblade Gear state ends, Calcharo's next Intro Skill is replaced with Intro Skill \"Necessary Means\", which deals Electro DMG, considered as Intro Skill damage.",
          "skillVars": {
            "Deathblade Gear": "- Basic Attack is replaced with Basic Attack Hounds Roar;\n- Heavy Attack deals increased DMG, considered as Resonance Liberation damage;\n- Dodge Counter deals increased damage, considered Resonance Liberation damage.",
            "Basic Attack: Hounds Roar": "Calcharo performs up to 5 consecutive attacks, dealing Electro DMG, considered as Basic Atttack damage."
          }
        },
        "Intro Skill": {
          "skillName": "Wanted Outlaw",
          "skillDesc": "Attack the target, dealing Electro DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Shadowy Raid",
          "skillDesc": "Calcharo summons Phantom to support the active Resonator, clearing the targets in front with a slash. The Phantom's attack deals Electro DMG equal to 195.98%+391.96% of Calcharo's ATK.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Bloodshed Awaken",
          "skillDesc": "When casting Heavy Attack \"Mercy\", Calcharo's Resonance Liberation damage bonus is increased by 10% for 15s.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Revenant Rush",
          "skillDesc": "When Heavy Attack \"Death Messenger\" hits the target, the damage taken by Calcharo is reduced by 15% for 5s.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "calcharo_icon.png",
        "portrait": "calcharo_portrait.png"
      }
    },
    {
      "id": 5,
      "name": "Chixia",
      "rarity": 4,
      "attribute": "Fusion",
      "weapon": "Pistols",
      "profile": {
        "info": "Chixia is a spirited young Patroller who lights up the streets of Jinzhou. She's always ready to be the hero someone needs.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "POW POW",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Chixia fires up to 4 consecutive shots, dealing Fusion DMG.",
            "Heavy Attack": "Chixia enters the aiming state for a more powerful shot. The aimed shot fired after charging finishes deals Fusion DMG.",
            "Mid-air Attack": "Chixia consumes STA to perform consecutive shots at the target in mid-air, dealing Fusion DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Fusion DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Heroic Bullets",
          "skillDesc": "",
          "skillVars": {
            "Resonance Skill: DAKA DAKA!": "Hold Resonance Skill Whizzing Fight Spirit to enter \"DAKA DAKA!\". In this state:\n- Chixia continuously consumes \"Thermobaric Bullets\" to attack the target, dealing Fusion DMG, considered as Resonance Skill damage;\n- Tap Basic Attack to cast Basic Attack 4, dealing Fusion DMG, considered as Basic Attack damage. Then she exits the \"DAKA DAKA!\" state;\n- If 30 \"Thermobaric Bullets\" have been fired when Basic Attack is activated, Chixia will cast Resonance Skill Boom Boom and terminate \"DAKA DAKA!\".\n- Chixia exits the \"DAKA DAKA!\" state when all \"Thermobaric Bullets\" are consumed.",
            "Resonance Skill: Boom Boom": "Deal Fusion DMG, considered as Resonance Skill damage.",
            "Thermobaric Bullets": "Chixia can hold up to 60 \"Thermobaric Bullets\".\n- Inherent Skill Scorching Magazine increases max \"Thermobaric Bullets\" by 10.\n- Chixia obtains \"Thermobaric Bullets\" for every Normal Attack POW POW on hit.\n- Chixia obtains \"Thermobaric Bullets\" upon casting Intro Skill Grand Entrance and Resonance Skill Whizzing Fight Spirit."
          }
        },
        "Resonance Skill": {
          "skillName": "Whizzing Fight Spirit",
          "skillDesc": "Chixia unleashes a flurry of shots, dealing Fusion DMG. Whizzing Fight Spirit has 2 initial charges.",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Blazing Flames",
          "skillDesc": "Chixia fires up fast shots at nearby enemies, dealing Fusion DMG.",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Grand Entrance",
          "skillDesc": "Chixia makes a heroic entrance and fires rapidly with her dual pistols at the target, dealing Fusion DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Leaping Flames",
          "skillDesc": "Chixia releases a shockwave surrounding the target, dealing Fusion DMG equal to 530% of Chixia's ATK to enemies within the range.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Scorching Magazine",
          "skillDesc": "Max \"Thermobaric Bullets\" is increased by 10 rounds. The damage of Resonance Skill Boom Boom is increased by 50%.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Numbingly Spicy!",
          "skillDesc": "Each \"Thermobaric Bullets\" that hits a target during Resonance Skill DAKA DAKA! increases ATK by 1% for 10s, stacking up to 30 times.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "chixia_icon.png",
        "portrait": "chixia_portrait.png"
      }
    },
    {
      "id": 6,
      "name": "Danjin",
      "rarity": 4,
      "attribute": "Havoc",
      "weapon": "Sword",
      "profile": {
        "info": "With a vengeful blade of condensed blood in hand, Ranger Danjin hunts down thieves and bandits for retribution. She journeys to distant lands in pursuit of justice.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Execution",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Danjin performs up to 3 consecutive attacks, dealing Havoc DMG.",
            "Heavy Attack": "Danjin consumes STA to launch consecutive attacks, dealing Havoc DMG.",
            "Mid-air Attack": "Consume STA to perform a Mid-air Plunging Attack, dealing Havoc DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to launch an attack, dealing Havoc DMG.",
            "Dodge Counter: Ruby Shades": "After a successful Dodge Counter, Danjin can use Resonance Skill Crimson Fragment to perform Resonance Skill: Crimson Erosion."
          }
        },
        "Forte Circuit": {
          "skillName": "Serene Vigil",
          "skillDesc": "Chaoscleave, dealing Havoc DMG, considered as Heavy Attack damage, and healing Danjin. If current \"Ruby Blossom\" reaches over 120, 120 \"Ruby Blossom\" is consumed instead to increase the damage multiplier of Chaoscleave and Scatterbloom performed this time.",
          "skillVars": {
            "Heavy Attack: Scatterbloom": "Use Basic Attack after Heavy Attack Chaoscleave to cast Scatterbloom to attack the target, dealing Havoc DMG, considered as Heavy Attack damage.",
            "Ruby Blossom": "Danjin can hold up to 120 Ruby Blossom. Danjin obtains \"Ruby Blossom\" when using Resonance Skill Crimson Fragment."
          }
        },
        "Resonance Skill": {
          "skillName": "Crimson Fragment",
          "skillDesc": "",
          "skillVars": {
            "Crimson Erosion": "After Basic Attack 2, Dodge Counter or Intro Skill Vindication, use Resonance Skill to perform up to 2 consecutive strikes, dealing Havoc DMG. When Crimson Erosion 2 hits a target, apply Incinerating Will to it.",
            "Incinerating Will": "Danjin's damage dealt to targets marked with Incinerating Will is increased by 20%.",
            "Sanguine Pulse": "Use Resonance Skill after Basic Attack 3 to perform up to 3 consecutive attacks, dealing Havoc DMG."
          }
        },
        "Resonance Liberation": {
          "skillName": "Crimson Bloom",
          "skillDesc": "Danjin's anger intensifies as she frantically swings her dual blades, performing multiple rapid consecutive attacks, and 1 Scarlet Burst attack(s), dealing Havoc DMG.",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Vindication",
          "skillDesc": "With unwavering determination, Danjin unleashes a strike, dealing Havoc DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Duality",
          "skillDesc": "The incoming character (or a character on a nearby team that activates an Outro Skill) has their Havoc DMG Amplified by 23% for 14s or until they are switched off field.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Crimson Light",
          "skillDesc": "Damage of Resonance Skill Crimson Erosion triggered by Dodge Counter: Ruby Shades is increased by 20%. The HP cost and stacks of \"Ruby Blossom\" recovered are doubled.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Overflow",
          "skillDesc": "After casting the Resonance Skill Sanguine Pulse, Danjin's Heavy Attack damage is increased by 30% for 5s.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "danjin_icon.png",
        "portrait": "danjin_portrait.png"
      }
    },
    {
      "id": 7,
      "name": "Encore",
      "rarity": 5,
      "attribute": "Fusion",
      "weapon": "Rectifier",
      "profile": {
        "info": "A girl accompanied by one black and one white Wooly plushies. Encore, consultant from the Black Shores, is longing to create happy stories with candies, fairy tales, and her imagination.",
        "gender": "Female",
        "birthplace": "New Federation",
        "affiliation": "The Black Shores"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Wooly Attack",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Encore performs up to 4 consecutive attacks, dealing Fusion DMG.",
            "Basic Attack: Wooly Strike": "After Basic Attack 4, press the Basic Attack button to attack the target, dealing Fusion DMG.",
            "Heavy Attack": "Encore consumes STA to attack the target, dealing Fusion DMG.",
            "Mid-air Attack": "Encore consumes STA to perform a Mid-Air Plunging Attack, dealing Fusion DMG.",
            "Dodge Counter": "Use Basic Attack after successful Dodge to attack the target, dealing Fusion DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Black & White Woolies",
          "skillDesc": "",
          "skillVars": {
            "Heavy Attack: Cloudy Frenzy": "When Encore's \"Mayhem\" is full, after casting a Heavy Attack, Encore will consume all \"Mayhem\" to enter the Mayhem state, reducing damage taken by 70%. Switching characters does not interrupt the Mayhem state. After the Mayhem state ends, Encore will cast Cloudy Frenzy, dealing Fusion DMG, considered as Resonance Liberation damage.",
            "Heavy Attack: Cosmos Rupture": "During Cosmos Rave, when casting Heavy Attack, if \"Mayhem is full, Encore will consume all \"Mayhem\" to enter Cosmos' Mayhem state, reducing damage taken by 70%. Switching characters does not interrupt the Cosmos' Mayhem state. After Cosmos' Mayhem state ends, Encore will cast Cosmos Rupture, dealing Fusion DMG, considered as Resonance Liberation damage.",
            "Mayhem": "Encore can hold up to 100 \"Mayhem\".\n- When Normal Attack Wooly Attack hits a target, Encore restores \"Mayhem\".\n- When Resonance Skill Flaming Woolies hits a target, Encore restores \"Mayhem\".\n- When Resonance Skill Energetic Welcome hits a target, Encore restores \"Mayhem\".\n- When Intro Skill Woolies Helpers hits a target, Encore restores \"Mayhem\".\n- During the duration of Resonance Liberation Cosmos Rave, Encore restores \"Mayhem\" when hitting a target."
          }
        },
        "Resonance Skill": {
          "skillName": "Flaming Woolies",
          "skillDesc": "",
          "skillVars": {
            "Flaming Woolies": "Encore summons Cloudy and Cosmos to attack with burning rays, dealing Fusion DMG.",
            "Energetic Welcome": "After casting Flaming Woolies, use Resonance Skill to perform Energetic Welcome, dealing Fusion DMG."
          }
        },
        "Resonance Liberation": {
          "skillName": "Cosmos Rave",
          "skillDesc": "As Encore loses control, Cosmos breaks free and wreaks havoc on its surroundings.",
          "skillVars": {
            "Basic Attack: Cosmos - Frolicking": "During Cosmos Rave, the Basic Attack is replaced with Cosmos- Frolicking, which performs up to 4 consecutive attacks, dealing Fusion DMG, considered as Basic Attack damage.",
            "Cosmos - Heavy Attack": "During Cosmos Rave, the Heavy Attack is replaced with Cosmos - Heavcy Attack, consuming STA to attack the target, dealing Fusion DMG, considered as Heavy Attack damage.",
            "Resonance Skill: Cosmos - Rampage": "During Cosmos Rave, Flaming Woolies is replaced with Cosmos - Rampage, dealing Fusion DMG, considered as Resonance Skill damage.",
            "Cosmos - Dodge Counter": "During Cosmos Rave, use Basic Attack after a successful Dodge to attack the target, dealing Fusion DMG, considered as Basic Attack damage."
          }
        },
        "Intro Skill": {
          "skillName": "Woolies Helpers",
          "skillDesc": "Encore pounces at the enemies with Cosmos, dealing Fusion DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Thermal Field",
          "skillDesc": "Encore generates a Thermal Field centered around skill target, with a radius of 3m. Targets inside the Thermal Field are continuously burned, suffering Fusion DMG equal to 176.76% of Encore's ATK every 1.5s for 6s.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Angry Cosmos",
          "skillDesc": "During the Resonance Liberation Cosmos Rave, when Encore's HP is above 70%, damage dealt is increased by 10%.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Woolies Cheer Dance",
          "skillDesc": "When Resonance Skill Flaming Woolies or Resonance Skill Cosmos - Rampage is cast, Encore's Fusion DMG Bonus is increased by 10% for 10s.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "encore_icon.png",
        "portrait": "encore_portrait.png"
      }
    },
    {
      "id": 8,
      "name": "Jianxin",
      "rarity": 5,
      "attribute": "Aero",
      "weapon": "Gauntlet",
      "profile": {
        "info": "Jianxin, a Taoist monk and successor of Fengyiquan, has dedicated her life to mastering the ultimate martial art. With the power to harness and transform environmental Chi, she can create protective barriers that purify both body and mind.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Fengyiquan",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Jianxin performs up to 4 consecutive attacks, dealing Aero DMG.",
            "Heavy Attack": "Jianxin consumes STA to attack the target, dealing Aero DMG.",
            "Mid-air Attack": "Jianxin consumes STA to plunge and unleash a powerful kick, dealing Aero DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Aero DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Primordial Chi Spiral",
          "skillDesc": "",
          "skillVars": {
            "Heavy Attack: Primordial Chi Spiral": "When \"Chi\" reaches max stacks, hold Heavy Attack to cast Primordial Chi Spiral and start Zhoutian Progress.",
            "Zhoutian Progress": "Jianxin's resistance to interruption is increased, and her damage taken is reduced by 50%. Jianxin continuously consumes \"Chi\" and casts Chi Strike to attack targets nearby, dealing Aero DMG.\n\nAs Zhoutian Progress accumulates, Jianxin reaches different Zhoutian and gains effects accordingly:\n- Before Minor Zhoutian: Gain Zhoutian Progress 1 shield. When Zhoutian Progress is interrupted, cast Pushing Punch to attack the target, dealing Aero DMG.\n- Minor Zhoutian: Gain Zhoutian Progress 2 shield and cast Shock to attack the target, dealing Aero DMG. When Zhoutian Progress is interrupted, cast Yielding Pull to attack the target, dealing Aero DMG.\n- Major Zhoutian - Inner: Gain Zhoutian Progress 3 shield and cast Shock to attack the target, dealing Aero DMG. When Zhoutian Progress is interrupted, cast Yielding Pull to attack the target, dealing Aero DMG.\n- Major Zhoutian - Outer: Gain Zhoutian Progress 3 shield and cast Shock to attack the target, dealing Aero DMG.\n- When Basic Attack button is released, interrupted Zhoutian Progress and lose all \"Chi\";\n- When all \"Chi\" is consumed, end Zhoutian Progress.\n\nWhen Zhoutian Progress ends, regain a shield according to the Zhoutian Progress reached,. As the shield provided by Heavy Attack: Primordial Chi Spiral persists, the active character is healed once every 6s.",
            "Chi": "Jianxin can hold up to 120 Chi.\n- Chi is obtained when a Normal Attack Fengyiquan hits the target.\n- Chi is obtained when the Resonance Skill Calming Air is cast.\n- Chi is obtained when the Resonance Skills Chi Counter or Chi Parry hits the target.\n- Chi is obtained when the Intro Skill Essence of Tao hits the target."
          }
        },
        "Resonance Skill": {
          "skillName": "Calming Air",
          "skillDesc": "Hold Resonance Skill to enter Parry Stance.",
          "skillVars": {
            "Chi Counter": "When Jianxin is attacked in the Parry Stance, she does not take damage and immediately performs Chi Counter, dealing Aero DMG.",
            "Chi Parry": "Release the Resonance Skill button during Parry Stance to interrupt Parry Stance and perform Chi Parry, dealing Aero DMG."
          }
        },
        "Resonance Liberation": {
          "skillName": "Purification Force Field",
          "skillDesc": "Create a strong wind field, continuously pulling targets within the wind field to the center and dealing Aero DMG. When the wind field disappears, it will trigger an explosion to deal Aero DMG to all targets within the range again.",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Essence of Tao",
          "skillDesc": "Pull in targets within the range, dealing Aero DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Transcendence",
          "skillDesc": "The incoming character (or a character on a nearby team that activates an Outro Skill) has their Resonance Liberation DMG Amplified by 38% for 14s or until they are switched off field.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Formless Release",
          "skillDesc": "Damage of Resonance Liberation Purification Force Field is increased by 20%",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Reflection",
          "skillDesc": "The Shield obtained with Heavy Attack Primordial Chi Spiral is increased by 20%.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "jianxin_icon.png",
        "portrait": "jianxin_portrait.png"
      }
    },
    {
      "id": 16,
      "name": "Jiyan",
      "rarity": 5,
      "attribute": "Aero",
      "weapon": "Broadblade",
      "profile": {
        "info": "Jiyan, leader of the Midnight Rangers, acts with swift and resolute righteousness. He possesses the formidable ability to conjure a powerful Qingloong from the winds, making him invincible on the battlefield.",
        "gender": "Male",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Lone Lance",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Jiyan performs up to 5 consecutive attacks, dealing Aero DMG.",
            "Heavy Attack": "Jiyan consumes Stamina to thrust forward, dealing Aero DMG.",
            "Heavy Attack: Windborne Strike": "Hold the Basic Attack during Heavy Attack to cast Windborne Strike after the Heavy Attack ends, dealing Aero DMG.",
            "Heavy Attack: Abyssal Slash": "Release the Basic Attack during the Heavy Attack to cast Abyssal Slash after the Heavy Attack ends, dealing Aero DMG.",
            "Mid-air Attack": "Jiyan consumes Stamina to perform a Mid-Air Plunging Attack, dealing Aero DMG. After the Plunging Attack, use Basic Attack to perform a follow-up attack, dealing Aero DMG.",
            "Mid-air Attack: Banner of Triumph": "After casting the Heavy Attack Windborne Strike or the Resonance Skill Windqueller in the air, Jiyan can perform a mid-air attack, dealing Aero DMG.",
            "Dodge Counter": "Use a Basic Attack after a successful Dodge to attack the target, dealing Aero DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Qingloong at War",
          "skillDesc": "When casting Resonance Skill Windqueller, if Jiyan has 30 or more \"Resolve\", he consumes 30 \"Resolve\" to increase the damage of this Resonance Skill Windqueller by 20%. When Jiyan is in Qingloong Mode, DMG of Resonance Skill Windqueller is increased by 20% and no longer consumes \"Resolve\".",
          "skillVars": {
            "Resonance Liberation: Emerald Storm: Finale": "When casting Resonance Liberation Emerald Storm: Prelude, if Jiyan has 30 \"Resolve\" or more, he will consume 30 \"Resolve\" to cast Emerald Storm: Finale, dealing Aero DMG, considered as Heavy Attack damage. Emerald Storm: Finale can be cast in mid-air at low altitude.",
            "Resolve": "Jiyan can hold up to 60 Resolve. Jiyan gains \"Resolve\" when his Normal Attack Lone Lance hits the target. Jiyan gains \"Resolve\" when the Intro Skill Tactical Strike hits the target. If Jiyan does not hit a target within 15s, his \"Resolve\" will gradually decrease."
          }
        },
        "Resonance Skill": {
          "skillName": "Windqueller",
          "skillDesc": "Dash forward a certain distance, dealing Aero DMG. Can be cast in the air.",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Emerald Storm: Prelude",
          "skillDesc": "After releasing Emerald Storm: Prelude, Jiyan enters Qingloong Mode.",
          "skillVars": {
            "Qingloong Mode": "Jiyan has increased Anti-interruption; Basic Attack, Heavy Attack and Dodge Counter are replaced with Heavy Attack Lance of Qingloong.",
            "Heavy Attack: Lance of Qingloong": "Perform up to 3 continuous attacks, dealing Aero DMG, considered as Heavy Attack damage."
          }
        },
        "Intro Skill": {
          "skillName": "Tactical Strike",
          "skillDesc": "Jiyan pierces the target in mid-air, dealing Aero DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Discipline",
          "skillDesc": "When the next character's (or other characters on a nearby team that activates an Outro Skill) Heavy Attack hits a target, Jiyan will summon Qingloong to launch a Coordinated Attack, dealing Aero DMG equal to 313.40% of Jiyan's ATK. This attack lasts for 8s, and can be triggered once every 1s, up to 2 times.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Heavenly Balance",
          "skillDesc": "After casting the Intro Skill Tactical Strike, Jiyan's ATK is increased by 10% for 15s.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Wind Gathering",
          "skillDesc": "When Jiyan's attacks hit a target, Jiyan's Crit. DMG is increased by 12% for 8s.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "jiyan_icon.png",
        "portrait": "jiyan_portrait.png"
      }
    },
    {
      "id": 9,
      "name": "Lingyang",
      "rarity": 5,
      "attribute": "Glacio",
      "weapon": "Gauntlet",
      "profile": {
        "info": "Lingyang is talented and friendly member of the Liondance Troupe in Jinzhou. His passion and courage are evident as he engages with humans, showcasing his impressive physical abilities. With his unique style, he embodies the spirit of Liondancing.",
        "gender": "Male",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Majestic Fists",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Lingyang performs up to 5 consecutive attacks, dealing Glacio DMG.",
            "Basic Attack: Feral Roars": "After Resonance Skill Furious Punches is cast, Basic Attack 5 is replaced with Feral Roars, dealing Glacio DMG.",
            "Heavy Attack": "Lingyang consumes Stamina to attack the target, dealing Glacio DMG.",
            "Mid-air Attack": "Lingyang consumes Stamina to perform a Mid-air Plunging Attack, dealing Glacio DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Glacio DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Unification of Spirits",
          "skillDesc": "",
          "skillVars": {
            "Heavy Attack: Glorious Plunge": "When Lion's Spirit is full, use Heavy Attack to perform Glorious Plunge, dealing Glacio DMG.",
            "Mid-air Attack: Tail Strike": "When Lion's Spirit is not full, use Basic Attack after Heavy Attack to perform Tail Strike, dealing Glacio DMG.",
            "Striding Lion": "After casting Heavy Attack Glorious Plunge, enter Striding Lion state; After casting Intro Skill Lion Awakens or Resonance Liberation Strive: Lion's Vigor, if \"Lion's Spirit\" is full, use Basic Attack to enter Striding Lion state.\n\nIn the Striding Lion state:\n- Attacks can be launched in mid-air. If Lingyang is on the ground, use Heavy Attack Glorious Plunge to get back in the air.\n- \"Lion's Spirit\" is continuously consumed before running out in 5s, and when it runs out, Striding Lion ends;\n- If Lingyang is in the Resonance Liberation Lion's Vigor state, the consumption speed of \"Lion's Spirit\" is reduced by 50%, extending Striding Lion state by up to 10s.\n- Lingyang's Basic Attack is replaced with Basic Attack Feral Gyrate, which performs up to 2 consecutive attacks, dealing Glacio DMG;\n- Lingyang's Resonance Skill is replaced with Mountain Roamer, dealing Glacio DMG;\n- When \"Lion's Spirit\" is less than 10, use Basic Attack to perform Stormy Kicks, dealing Glacio DMG; after beforming Basic Attack Stormy Kicks, the Mid-air Attack Tail Strike becomes available.\n\nConcerto Energy is restored when \"Lion's Spirit\" is consumed.",
            "Lion's Spirit": "Lingyang can hold up to 100 \"Lion's Spirit\".\n- When casting Resonance Skill Furious Punches, \"Lion's Spirit\" is restored.\n- When casting Intro Skill Lion Awakens, \"Lion's Spirit\" is restored.\n- When casting Resonance Liberation Strive: Lion's Vigor, \"Lion's Spirit\" is restored."
          }
        },
        "Resonance Skill": {
          "skillName": "Ancient Arts",
          "skillDesc": "",
          "skillVars": {
            "Ancient Arts": "Attack the target, dealing Glacio DMG.",
            "Furious Punches": "When Basic Attacks 3, 4, or 5 or Basic Attack Feral Roars hits the target, Resonance Skill Ancient Arts is replaced with Resonance Skill Furious Punches. Lingyang's Basic Attack cycle starts from Basic Attack 3 after casting Basic Attack Feral Roars and Resonance Skill Furious Punches in turn.\n\nLingyang's Resonance Skill does not reset his Basic Attack cycle."
          }
        },
        "Resonance Liberation": {
          "skillName": "Strive: Lion's Vigor",
          "skillDesc": "Attack the target, dealing Glacio DMG, and receive the blessing of Lion's Vigor.",
          "skillVars": {
            "Lion's Vigor": "Lingyang's Glacio DMG bonus is increased by 50%."
          }
        },
        "Intro Skill": {
          "skillName": "Lion Awakens",
          "skillDesc": "Lingyang enters the battlefield, dealing Glacio DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Frosty Marks",
          "skillDesc": "Lingyang releases a shockwave centered on the skill target, dealing Glacio DMG equal to 587.94% of Lingyang's ATK to targets within the range.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Lion's Pride",
          "skillDesc": "Damage of the Intro Skill Lion Awakens is increased by 50%.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Diligent Practice",
          "skillDesc": "Under the Forte Circuit Striding Lion state, within 3s after each Basic Attack, the next Forte Circuit Mountain Roamer will deal additional Glacio DMG, equal to 150% of Mountain Roamer damage, considered as Resonance Skill damage",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "lingyang_icon.png",
        "portrait": "lingyang_portrait.png"
      }
    },
    {
      "id": 10,
      "name": "Mortefi",
      "rarity": 4,
      "attribute": "Fusion",
      "weapon": "Pistols",
      "profile": {
        "info": "Mortefi, a skilled expert in Applied Tacetite Study and a member of the Academy's Department of safety, possesses the unique ability to transform his accumulated frustration into fiery flames. From a burning wrath that consumes all, the red dragon shall descend.",
        "gender": "Male",
        "birthplace": "New Federation",
        "affiliation": "Jinzhou"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Impromptu Show",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Mortefi uses his dual pistols and flames to perform up to 4 consecutive shots, dealing Fusion DMG.",
            "Heavy Attack": "Mortefi enters the aiming state for a more powerful shot. The aimed shot fired after charging finishes deals Fusion DMG.",
            "Mid-air Attack": "Mortefi consumes STA to perform consecutive shots at the target in mid-air, dealing Fusion DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Fusion DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Fury Fugue",
          "skillDesc": "",
          "skillVars": {
            "Resonance Skill: Fury Fugue": "When Mortefi's \"Annoyance\" reaches 100, his Reosnance Skill is replaced with Fury Fudge. When casting Fury Fudge, Mortefi consumes all \"Annoyance\" to unleash high-speed flame lightning, dealing Fusion DMG, considered as Resonance Skill damage.",
            "Annoyance": "Mortefi can hold up to 100 Annoyance.\n- When Normal Attack Impromptu Show hits the target, \"Annoyance\" is restored.\n- When Intro Skill Dissonance hits the target, \"Annoyance\" is restored.\n- When Resonance Skill Passionate Variation hits the target, \"Annoyance\" is restored.\n- Within 5s after casting Passionate Variation, Basic Attack Impromptu Show that hits the target additionally restores \"Annoyance\"."
          }
        },
        "Resonance Skill": {
          "skillName": "Passionate Variation",
          "skillDesc": "Launch a flashing lightning of flames forward, dealing Fusion DMG.",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Violent Finale",
          "skillDesc": "Deal Fusion DMG, and apply Burning Rhapsody to all characters on the team.",
          "skillVars": {
            "Burning Rhapsody": "- When the active character's Basic Attack hits the target, Mortefi launches a Coordinated Attack, firing 1 Marcato.\n- When the active character's Heavy Attack hits the target, Mortefi launches a Coordinated ATtack, firing 2 Marcato.\n\nMortefi can launch one Coordinated Attack every 0.35s."
          }
        },
        "Intro Skill": {
          "skillName": "Dissonance",
          "skillDesc": "Attack the target, dealing Fusion DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Rage Transposition",
          "skillDesc": "The incoming Resonator (or Resonator on a nearby team that activates Outro Skill) has their Heavy ATtack damage amplified by 38% for 14s or until they are switched off field.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Harmonic Control",
          "skillDesc": "After casting Resonance Skill Passionate Variation, the damage of Resonance Skill Fury Fugue is increased by 25% for 8s.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Rhythmic Vibrato",
          "skillDesc": "During Resonance Liberation Burning Rhapsody, each hit of Resonance Liberation Marcato will increase the damage of the next Resonance Liberation Marcato by 1.5%, which can be triggered once every 0.35s, stacking up to 50 times. The effect will be reset after Resonance Liberation Burning Rhapsody ends.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "mortefi_icon.png",
        "portrait": "mortefi_portrait.png"
      }
    },
    {
      "id": 18,
      "name": "Rover (Havoc)",
      "rarity": 5,
      "attribute": "Havoc",
      "weapon": "Sword",
      "profile": {
        "info": "?",
        "gender": "?",
        "birthplace": "?",
        "affiliation": "?"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Tuneslayer",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Rover-Havoc performs up to 5 consecutive attacks, dealing Havoc DMG.",
            "Heavy Attack": "Rover-Havoc consumes STA to attack, dealing Havoc DMG. Use Basic Attack after casting Heavy Attack to cast Basic Attack 4.",
            "Mid-air Attack": "Rover-Havoc consumes STA to cast a Mid-Air Plunging ATtack, dealing Havoc DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Havoc DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Umbra Eclipse",
          "skillDesc": "",
          "skillVars": {
            "Devastation": "When \"Umbra\" is full, hold Basic Attack to cast Devastation to attack the target, dealing Havoc DMG, considered as Heavy Attack damage.",
            "Dark Surge": "After casting Devastation, Rover enters the Dark Surge state. In this state:\n- Basic Attack is replaced with Enhanced Basic Attack, which performs up to 5 consecutive attacks, dealing Havoc DMG;\n- Heavy Attack is replaced with Enhanced Heavy Attack;\n- Use Basic Attack after casting Enhanced Heavy Attack to cast Heavy Attack Thwackblade to attack the target, dealing Havoc DMG, considered as Heavy Attack damage;\n- Use Basic Attack after casting Heavy ATtack Thwackblade to cast Enhanced Basic Attack 3 to attack the target, dealing Havoc DMG;\n- Resonance Skill Wingblade is replaced with Resonance Skill Lifetaker, transforming sounds into blades to attack the target, dealing Havoc DMG.",
            "Umbra": "Rover can hold up to 100 points of Umbra.\n- Normal Attack Tuneslayer recovers Umbra on hit.\n- Resonance Skill Wingblade recovers Umbra when cast.\n- Resonance Skill Lifetaker recovers Umbra when cast.\n- Intro Skill Instant of Annihilation recovers Umbra when cast."
          }
        },
        "Resonance Skill": {
          "skillName": "Wingblade",
          "skillDesc": "Transform sound into feathers, dealing Havoc DMG.",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Deadening Abyss",
          "skillDesc": "Rover gathers resonating sounds to attack a target, dealing Havoc DMG.",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Instant of Annihilation",
          "skillDesc": "Attack the target, dealing Havoc DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Soundweaver",
          "skillDesc": "Rover summons a Havoc Field, dealing Havoc DMG equal to 143.3% of Rover's ATK to all targets within range every 2s for 6s.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Metamorph",
          "skillDesc": "In the Dark Surge state, Havoc DMG bonus is increased by 20%.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Bleak Crescendo",
          "skillDesc": "While in the Dark Surge state, Basic Attack recovers 1 extra Resonance Energy when it hits a target, and this effect can be triggered 1 time per second.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "roverM_icon.png",
        "portrait": "roverM_portrait.png"
      }
    },
    {
      "id": 1,
      "name": "Rover (Spectro)",
      "rarity": 5,
      "attribute": "Spectro",
      "weapon": "Sword",
      "profile": {
        "info": "?",
        "gender": "?",
        "birthplace": "?",
        "affiliation": "?"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Vibration Manifestation",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Rover performs up to 4 consecutive attacks, dealing Spectro DMG.",
            "Heavy Attack": "Rover consumes STA to attack the target, dealing Spectro DMG.",
            "Heavy Attack: Resonance": "After Basic Attack 3 or Heavy ATtack, press the Basic Attack button at the right time to perform Heavy Attack Resonance, dealing Spectro DMG.",
            "Heavy Attack: Aftertune": "After Heavy Attack Resonance or Dodge Counter hits a target, press the Basic Attack button to perform Heavy Attack Aftertune, dealing Spectro DMG.",
            "Mid-air Attack": "Rover consumes STA to perform a Mid-Air Plunging ATtack, dealing Spectro DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Spectro DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "World in a Grain of Sand",
          "skillDesc": "",
          "skillVars": {
            "Resonance Skill: Resonating Spin": "If \"Diminutive Sound\" exceeds 50 when Resonance Skill is used, Rover consumes 50 \"Diminutive Sound\" to cast Resonating Spin, dealing Spectro DMG, considered as Resonance SKill damage.",
            "Basic Attack: Resonating Echoes": "After Resonance Skill Resonating Spin ends, Rover performs Resonating Echoes upon using Basic Attack.\n\nLaunch attacks forward, dealing Spectro DMG, considered as Resonance Skill DMG.",
            "Diminutive Sound": "Rover can hold up to 100 \"Diminutive Sounds\".\n- Rover obtains \"Diminutive Sound\" for every Normal Attack Vibraton Manifestation on hit.\n- Rover obtains \"Diminutive Sound\" for every Heavy ATtack Aftertune on hit.\n- Rover obtains \"Diminutive Sound\" upon casting Intro Skill Waveshock."
          }
        },
        "Resonance Skill": {
          "skillName": "Resonating Slashes",
          "skillDesc": "Rover launches an attack forward, dealing Spectro DMG.",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Echoing Orchestra",
          "skillDesc": "Rover converges Spectro energy to assail the target area, detonating it after a short delay and dealing Spectro DMG.",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Waveshock",
          "skillDesc": "Rover attacks the target, dealing Spectro DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Instant",
          "skillDesc": "Generate an area of stasis surrounding the next character (or a character on a nearby team that activates an Outro Skill), lasting for 3s.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Reticence",
          "skillDesc": "Damage dealt by Rover's Basic Attack Resonating Echoes is increased by 60%.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Silent Listener",
          "skillDesc": "Rover gains 15% ATK increase for 5s upon casting Heavy Attack Resonance.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "roverM_icon.png",
        "portrait": "roverM_portrait.png"
      }
    },

    {
      "id": 11,
      "name": "Sanhua",
      "rarity": 4,
      "attribute": "Glacio",
      "weapon": "Sword",
      "profile": {
        "info": "The bodyguard of Jinzhou's Magistrate, known for having an icy personality. Once regarded as the Asura of Calamity, Sanhua is now a taciturn guardian. She has learned to maintain inner calmness amidst the chaotic frequencies, and the things that once frightened her now fuel her determination.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Frigid Light",
          "skillDesc": "",
          "skillVars": {
            "Basic Attack": "Sanhua performs up to 5 consecutive attacks, dealing Glacio DMG.",
            "Heavy Attack": "Sanhua consumes STA to launch attacks, dealing Glacio DMG.",
            "Mid-air Attack": "Sanhua consumes STA to perform a Mid-Air Plunging ATtack, dealing Glacio DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Glacio DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Clarity of Mind",
          "skillDesc": "",
          "skillVars": {
            "Heavy Attack: Detonate": "When holding Basic Attack, a cursor moves back and forth on the Forte Gauge. Release Basic Attack while the cursor falls in the \"Frostbite\" area to perform Heavy Attack Detonate, dealing Glacio DMG considered as Heavy Attack damage.",
            "Ice Burst": "Sanhua's Heavy Attack Detonate detonates all \"Ice Thorns\", \"Ice Prisms\" and \"Glaciers\" within her attack range, dealing Glacio DMG. Ice Burst deals Resonance Skill DMG.",
            "Frostbite Area": "The \"Frostbite\" area expands with every 1 stack of \"Clarity\". Clarity stacks up to 2 times.\n- Sanhua obtains 1 stack of Clarity upon performing Basic Attack 5.\n- Sanhua obtains 1 stack of Clarity upon casting Intro Skill Freezing Thorns.\n- Sanhua obtains 1 stack of Clarity upon casting Resonance Skill Eternal Frost.\n- Sanhua obtains 2 stacks of Clarity upon casting Resonance Liberation Glacial Gaze.\n\n Upon casting Heavy Attack Detonate, all \"Clarity\" is removed."
          }
        },
        "Resonance Skill": {
          "skillName": "Eternal Frost",
          "skillDesc": "Sanhua sends an air blade to create 1 \"Ice Prism\" on the ground, dealing Glacio DMG.",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Glacial Gaze",
          "skillDesc": "Sanhua deals Glacio DMG and creates 1 \"Glacier\".",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Freezing Thorns",
          "skillDesc": "Sanhua swings her blade downward and creates 1 \"Ice Thorn\", dealing Glacio DMG.",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Silversnow",
          "skillDesc": "The incoming Resonator (or Resonator on a nearby team that activates Outro Skill) has their Basic Attack damage amplified by 38% for 14s or until they are switched off field.",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Condensation",
          "skillDesc": "Damage dealt by Sanhua's Resonance Skill increased by 20% for 8s after casting her Intro Skill.",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Avalanche",
          "skillDesc": "Damage dealt by Sanhua's Forte Circuit Ice Brust is increased by 20% for 8s after casting Basic Attack 5.",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "sanhua_icon.png",
        "portrait": "sanhua_portrait.png"
      }
    },
    {
      "id": 12,
      "name": "Taoqi",
      "rarity": 4,
      "attribute": "Havoc",
      "weapon": "Broadblade",
      "profile": {
        "info": "",
        "gender": "",
        "birthplace": "",
        "affiliation": ""
      },
      "skills": {
        "Normal Attack": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Forte Circuit": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "taoqi_icon.png",
        "portrait": "taoqi_portrait.png"
      }
    },
    {
      "id": 13,
      "name": "Verina",
      "rarity": 5,
      "attribute": "Spectro",
      "weapon": "Rectifier",
      "profile": {
        "info": "",
        "gender": "",
        "birthplace": "",
        "affiliation": ""
      },
      "skills": {
        "Normal Attack": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Forte Circuit": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "verina_icon.png",
        "portrait": "verina_portrait.png"
      }
    },
    {
      "id": 14,
      "name": "Yangyang",
      "rarity": 4,
      "attribute": "Aero",
      "weapon": "Sword",
      "profile": {
        "info": "",
        "gender": "",
        "birthplace": "",
        "affiliation": ""
      },
      "skills": {
        "Normal Attack": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Forte Circuit": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "yangyang_icon.png",
        "portrait": "yangyang_portrait.png"
      }
    },
    {
      "id": 17,
      "name": "Yinlin",
      "rarity": 5,
      "attribute": "Electro",
      "weapon": "Rectifier",
      "profile": {
        "info": "",
        "gender": "",
        "birthplace": "",
        "affiliation": ""
      },
      "skills": {
        "Normal Attack": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Forte Circuit": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "yinlin_icon.png",
        "portrait": "yinlin_portrait.png"
      }
    },
    {
      "id": 15,
      "name": "Yuanwu",
      "rarity": 4,
      "attribute": "Electro",
      "weapon": "Gauntlet",
      "profile": {
        "info": "",
        "gender": "",
        "birthplace": "",
        "affiliation": ""
      },
      "skills": {
        "Normal Attack": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Forte Circuit": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "",
          "skillDesc": "",
          "skillVars": {}
        }
      },
      "image": {
        "icon": "yuanwu_icon.png",
        "portrait": "yuanwu_portrait.png"
      }
    }
  ]
}
