{
  "name": "characters",
  "description": "Wuthering Waves Characters Dataset",
  "version": "1.1.0",
  "latestAdd": { "name": "Jinhsi", "id": 19 },
  "author": "MGSimard - https://github.com/MGSimard/",
  "data": [
    {
      "id": 2,
      "name": "Aalto",
      "rarity": 4,
      "attribute": "Aero",
      "weapon": "Pistols",
      "profile": {
        "info": "Aalto is an enigmatic Information Broker, known for his elusive nature and welcoming smile. Rumor has it he'll provide any information at the right price.",
        "gender": "Male",
        "birthplace": "New Federation",
        "affiliation": "The Black Shores"
      },
      "image": {
        "icon": "aalto_icon.png",
        "portrait": "aalto_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Half Truths",
          "skillDesc": "",
          "skillIcon": "Aalto_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Aalto fires up to 5 consecutive shots, dealing Aero DMG. Basic Attack 4 will spread the \"Mist\" forward, which lasts for 1.5s.",
            "Heavy Attack": "Aalto enters the aiming state for a more powerful shot. The aimed shot fired after charging finishes deals Aero DMG.",
            "Mid-air Attack": "Aalto consumes STA to perform consecutive shots at the target in mid-air, dealing Aero DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Aero DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Misty Cover",
          "skillDesc": "When Aalto passes through \"Mist\" or \"Gate of Quandary\", he enters the Mistcloak Dash.",
          "skillIcon": "Aalto_ForteCircuit.webp",
          "skillVars": {
            "Mistcloak Dash": "- Movement speed increased;\n- During this period, \"Mist Drops\" are continuously consumed, and for each 1 \"Mist Drop\" consumed, 1 Mist Bullet(s) is generated.",
            "Mist Drops": "Aalto can hold to 6 \"Mist Drops\". When Basic Attack or Mid-air Attack passes through \"Mist\" and hits the target, 1 \"Mist Drop\" is recovered."
          }
        },
        "Resonance Skill": {
          "skillName": "Shift Trick",
          "skillDesc": "",
          "skillIcon": "Aalto_ResonanceSkill.webp",
          "skillVars": {
            "Mist Avatar": "Casts \"Mist\" and 1 \"Mist Avatar(s)\" to taunt the surrounding targets. The avatars inherit a portion of Aalto's HP and generate 6 Mist Bullets around them, dealing Aero DMG.",
            "Mist Bullets": "Deals Aero DMG, considered as Resonance Skill damage."
          }
        },
        "Resonance Liberation": {
          "skillName": "Flower in the Mist",
          "skillDesc": "Generate a \"Gate of Quandary\" in front, dealing Aero DMG. When bullets pass through the \"Gate of Quandary\", they deal increased DMG. \"Gate of Quandary\" lasts for 10s.",
          "skillIcon": "Aalto_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Feint Shot",
          "skillDesc": "Aalto shows up out of thin air to perform rapid continuous shooting, dealing Aero DMG.",
          "skillIcon": "Aalto_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Dissolving Mist",
          "skillDesc": "The incoming character (or a character on a nearby team that activates an Outro Skill) has their Aero DMG Amplified by 23% for 14s or until they are switched off field.",
          "skillIcon": "Aalto_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Perfect Performance",
          "skillDesc": "Aalto's Heavy Attack will always critically hit, triggered once every 30s.",
          "skillIcon": "Aalto_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Mid-game Break",
          "skillDesc": "Aalto will continuously recover STA when he is in the Forte Circuit Mistcloak Dash state.",
          "skillIcon": "Aalto_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Trickster's Opening Show": "The cooldown of Resonance Skill Shift Trick is reduced by 4s.",
        "Mistweaver's Debut": "\"Mist Avatar\" inherits 100% more HP from Aalto. When Aalto attacks targets taunted by the \"Mist Avatar(s)\", his ATK is increased by 15%.",
        "Hazey Transition": "When Aalto's Basic Attack or Mid-air Attack passes through the Mist, 2 more bullets will be generated, dealing 50% of the DMG of Basic Attack or Mid-air Attack.",
        "Blake Bloom for Finale": "The damage of Resonance Skill Mist Bullets is increased by 30%; Aalto receives 30% less damage in his Forte Circuit Mistcloak Dash state.",
        "Applause of the Lost": "In the Forte Circuit Mistcloak Dash state, Aalto's Aero DMG bonus is increased by 25% for 6s.",
        "Broker's Secrets": "Resonance Liberation Flower in the Mist now additionally increased Crit. Rate by 8%. When Aalto's Heavy Attack passes through the \"Gate of Quandary\", the damage dealt is additionally increased by 50%."
      }
    },
    {
      "id": 3,
      "name": "Baizhi",
      "rarity": 4,
      "attribute": "Glacio",
      "weapon": "Rectifier",
      "profile": {
        "info": "Baizhi is a researcher in Remnant Ecoacoustics.\n\nBaizhi's once unfulfilled wish has now manifested as her loyal companion. The remnant Creature You'tan is her source of healing powers, and a lifelong research focus.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "baizhi_icon.png",
        "portrait": "baizhi_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Destined Promise",
          "skillDesc": "",
          "skillIcon": "Baizhi_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Baizhi instructs You'tan to perform up to 4 consecutive attacks, dealing Glacio DMG.",
            "Heavy Attack": "Baizhi continuously consumes STA to command You'tan to attack enemies, dealing Glacio DMG. During Heavy Attack, Baizhi can command You'tan to move.",
            "Mid-air Attack": "Baizhi consumes STA and summons You'tan in mid-air to perform a Plunging Attack, dealing Glacio DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Glacio DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Cycle of Life",
          "skillDesc": "",
          "skillIcon": "Baizhi_ForteCircuit.webp",
          "skillVars": {
            "You'tan": "A Remnant Creature that answers to Baizhi's mind and desires while sharing all her stats. You'tan goes back to Baizhi when Baizhi dodges.",
            "Concentration": "Baizhi consumes all \"Concentrations\" when casting Heavy Attack or Resonance Skill Emergency Plan to continuously heal all characters on nearby teams. Each 1 \"Concentration\" consumed provides 1 healing. The healings happens every 2s.\n- When Baizhi consumes \"Concentration\" to cast Heavy Attack, Baizhi additionally restores Concerto Energy and Resonance Energy;\n- When Baizhi consumes \"Concentration\" to cast Resonance Skill Emergency Plan, Baizhi additionally restores Concerto Energy.",
            "Forte Gauge: Concentration": "Baizhi can hold up to 4 \"Concentrations\".\n- Baizhi obtains 1 \"Concentration\" for every Basic Attack on hit."
          }
        },
        "Resonance Skill": {
          "skillName": "Emergency Plan",
          "skillDesc": "Baizhi calls You'tan to attack the target, dealing Glacio DMG while immediately healing all characters on nearby teams.",
          "skillIcon": "Baizhi_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Momentary Union",
          "skillDesc": "Baizhi summons You'tan to heal all characters on nearby teams, generating 4 stacks of Remnant Entities.",
          "skillIcon": "Baizhi_ResonanceLiberation.webp",
          "skillVars": {
            "Remnant Entities": "Remnant Entities follow the active team members. 1 stack of Remnant Entities is automatically consumed to attack the targets every 2.5s, dealing Glacio DMG on hit while healing the active character on a nearby team."
          }
        },
        "Intro Skill": {
          "skillName": "Overflowing Frost",
          "skillDesc": "Baizhi calls You'tan to perform 1 plunging attack, dealing Glacio DMG while healing all characters on a nearby team.",
          "skillIcon": "Baizhi_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Rejuvenating Flow",
          "skillDesc": "Baizhi heals the incoming character (or a character on a nearby team that activates an Outro Skill) by 1.54% of her Max HP every 3s for 30s. The healed character(s) also have their All-Type DMG Amplified by 15% for 6s.",
          "skillIcon": "Baizhi_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Harmonic Range",
          "skillDesc": "When Baizhi casts Resonance Skill Emergency Plan, You'tan generates a field of Euphonia that lasts 15s.",
          "skillIcon": "Baizhi_InherentSkill1.webp",
          "skillVars": {
            "Euphonia": "ATK of the Resonators who pick up Euphonia is increased by 15% for 20s."
          }
        },
        "Inherent Skill 2": {
          "skillName": "Stimulus Feedback",
          "skillDesc": "Baizhi's Heavy Attack on hit heals the character with the lowest HP on a nearby team by 0.25% of her Max HP.",
          "skillIcon": "Baizhi_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Complex Simplicity": "Resonance Skill Emergency Plan additionally restores 2.5 Resonance Energy for every 1 \"Concentration\" consumed.",
        "Silent Tundra": "Resonance Skill Emergency Plan increased Baizhi's Glacio DMG bonus by 15% and her Healing by 15% if she has 4 \"Concentration\". These effects last for 12s.",
        "Veritas Lux Mea": "Intro Skill Overflowing Frost increases Baizhi's Max HP by 12% for 10s.",
        "Eternal Verity": "Upon casting Resonance Liberation Momentary Union, Resonance Liberation Remnant Entities gains the following enhancements:\n- Remnant Entities can be performed 2 more time(s);\n- Healing multiplier of Remnant Entities is increased by 20%;\n- Remnant Entities deals additional Glacio DMG equal to 1.20% of Baizhi's Max HP.",
        "A Wish Answered": "If a team member is downed when Baizhi is alive on the team, immediately revive them and restore their HP to 100% of their Max HP. This effect can be triggered once every 10 minute(s).",
        "Seeker's Devotion": "When Euphonia is picked up, increase the Glacio DMG bonus of all characters nearby by 12% for 20s."
      }
    },
    {
      "id": 4,
      "name": "Calcharo",
      "rarity": 5,
      "attribute": "Electro",
      "weapon": "Broadblade",
      "profile": {
        "info": "Leader of the \"Ghost Hounds\", an international mercenary group. Ruthless, vengeful, unforgiving. A potential client must be mindful of the price to pay before making him an offer.",
        "gender": "Male",
        "birthplace": "New Federation",
        "affiliation": "Ghost Hounds"
      },
      "image": {
        "icon": "calcharo_icon.png",
        "portrait": "calcharo_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Gnawing Fangs",
          "skillDesc": "",
          "skillIcon": "Calcharo_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Calcharo performs up to 4 consecutive attacks, dealing Electro DMG.",
            "Heavy Attack": "Consumes STA to attack the target, dealing Electro DMG.",
            "Mid-air Attack": "Consumes STA to perform a Mid-air Plunging Attack, dealing Electro DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Electro DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Hunting Mission",
          "skillDesc": "",
          "skillIcon": "Calcharo_ForteCircuit.webp",
          "skillVars": {
            "Heavy Attack: \"Mercy\"": "When Calcharo has 3 \"Cruelty\", his Heavy Attack is replaced with Heavy Attack \"Mercy\". When casting Heavy Attack \"Mercy\", Calcharo consumes 3 \"Cruelty\" to deal Electro DMG, considered as Heavy Attack damage, and recovers Resonance Energy and Concerto Energy.",
            "\"Cruelty\"": "Calcharo can hold up to 3 \"Cruelty\".\n- Under Resonance Liberation Deathblade Gears state, \"Cruelty\" cannot be acquired.\n- When Resonance Skill Extermination Order hits the target, gain 1 \"Cruelty\".",
            "Heavy Attack: \"Death Messenger\"": "When Calcharo has 5 \"Killing Intent\", his Basic Attack is replaced with Heavy Attack \"Death Messenger\". When casting Heavy Attack \"Death Messenger\", Calcharo consumes 5 \"Killing Intent\" to deal Electro DMG, considered as Resonance Liberation damage, and recovers Resonance Energy and Concerto Energy.",
            "\"Killing Intent\"": "Under Resonance Liberation Deathblade Gear state, Calcharo's Forte Gauge is replaced with \"Killing Intent\", stacking up to 5. When Basic Attack Hounds Roar hits the target, Calcharo gains 1 \"Killing Intent\"."
          }
        },
        "Resonance Skill": {
          "skillName": "Extermination Order",
          "skillDesc": "Calcharo performs up to 3 consecutive attacks, dealing Electro DMG.\n\nIf Calcharo is switched off field, or if Resonance Skill Extermination Order is not activated again in a while, this skill will enter Cooldown.\n\nResonance Skill Extermination Order does not interrupt Calcharo's Basic Attack cycle.",
          "skillIcon": "Calcharo_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Phantom Etching",
          "skillDesc": "Calcharo attacks the target, dealing Electro DMG and enters Deathblade Gear state. After Deathblade Gear state ends, Calcharo's next Intro Skill is replaced with Intro Skill \"Necessary Means\", which deals Electro DMG, considered as Intro Skill damage.",
          "skillIcon": "Calcharo_ResonanceLiberation.webp",
          "skillVars": {
            "Deathblade Gear": "- Basic Attack is replaced with Basic Attack Hounds Roar;\n- Heavy Attack deals increased DMG, considered as Resonance Liberation damage;\n- Dodge Counter deals increased damage, considered Resonance Liberation damage.",
            "Basic Attack: Hounds Roar": "Calcharo performs up to 5 consecutive attacks, dealing Electro DMG, considered as Basic Attack damage."
          }
        },
        "Intro Skill": {
          "skillName": "Wanted Outlaw",
          "skillDesc": "Attack the target, dealing Electro DMG.",
          "skillIcon": "Calcharo_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Shadowy Raid",
          "skillDesc": "Calcharo summons Phantom to support the active Resonator, clearing the targets in front with a slash. The Phantom's attack deals Electro DMG equal to 195.98%+391.96% of Calcharo's ATK.",
          "skillIcon": "Calcharo_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Bloodshed Awaken",
          "skillDesc": "When casting Heavy Attack \"Mercy\", Calcharo's Resonance Liberation damage bonus is increased by 10% for 15s.",
          "skillIcon": "Calcharo_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Revenant Rush",
          "skillDesc": "When Heavy Attack \"Death Messenger\" hits the target, the damage taken by Calcharo is reduced by 15% for 5s.",
          "skillIcon": "Calcharo_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Covert Negotiation": "When Resonance Skill Extermination Order hits a target, it additionally recovers 10 Resonance Energy. This can be triggered once every 20s.",
        "Zero-Sum Game": "After Calcharo casts Intro Skill Wanted Criminal or Intro Skill \"Necessary Means\", his Resonance Skill damage bonus is increased by 30% for 15s.",
        "Iron Fist Diplomacy": "During the Resonance Liberation Deathblade Gear state, Calcharo's Electro DMG bonus is increased by 25%.",
        "Dark Alliance": "After casting Outro Skill Shadowy Raid, Electro DMG bonus of all team members is increased by 20% for 30s.",
        "Unconventional Compact": "Intro Skill Wanted Criminal and Intro Skill \"Necessary Means\" deal 50% more damage.",
        "The Ultimatum": "When casting Resonance Liberation \"Death Messenger\", Calcharo will summon 2 Phantoms to perform Coordinated Attacks. Each Phantom deals Electro DMG equal to 100.00% of Calcharo's ATK, which is considered Resonance Liberation damage."
      }
    },
    {
      "id": 5,
      "name": "Chixia",
      "rarity": 4,
      "attribute": "Fusion",
      "weapon": "Pistols",
      "profile": {
        "info": "Chixia is a spirited young Patroller who lights up the streets of Jinzhou. She's always ready to be the hero someone needs.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "chixia_icon.png",
        "portrait": "chixia_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "POW POW",
          "skillDesc": "",
          "skillIcon": "Chixia_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Chixia fires up to 4 consecutive shots, dealing Fusion DMG.",
            "Heavy Attack": "Chixia enters the aiming state for a more powerful shot. The aimed shot fired after charging finishes deals Fusion DMG.",
            "Mid-air Attack": "Chixia consumes STA to perform consecutive shots at the target in mid-air, dealing Fusion DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Fusion DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Heroic Bullets",
          "skillDesc": "",
          "skillIcon": "Chixia_ForteCircuit.webp",
          "skillVars": {
            "Resonance Skill: DAKA DAKA!": "Hold Resonance Skill Whizzing Fight Spirit to enter \"DAKA DAKA!\". In this state:\n- Chixia continuously consumes \"Thermobaric Bullets\" to attack the target, dealing Fusion DMG, considered as Resonance Skill damage;\n- Tap Basic Attack to cast Basic Attack 4, dealing Fusion DMG, considered as Basic Attack damage. Then she exits the \"DAKA DAKA!\" state;\n- If 30 \"Thermobaric Bullets\" have been fired when Basic Attack is activated, Chixia will cast Resonance Skill Boom Boom and terminate \"DAKA DAKA!\".\n- Chixia exits the \"DAKA DAKA!\" state when all \"Thermobaric Bullets\" are consumed.",
            "Resonance Skill: Boom Boom": "Deal Fusion DMG, considered as Resonance Skill damage.",
            "Thermobaric Bullets": "Chixia can hold up to 60 \"Thermobaric Bullets\".\n- Inherent Skill Scorching Magazine increases max \"Thermobaric Bullets\" by 10.\n- Chixia obtains \"Thermobaric Bullets\" for every Normal Attack POW POW on hit.\n- Chixia obtains \"Thermobaric Bullets\" upon casting Intro Skill Grand Entrance and Resonance Skill Whizzing Fight Spirit."
          }
        },
        "Resonance Skill": {
          "skillName": "Whizzing Fight Spirit",
          "skillDesc": "Chixia unleashes a flurry of shots, dealing Fusion DMG. Whizzing Fight Spirit has 2 initial charges.",
          "skillIcon": "Chixia_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Blazing Flames",
          "skillDesc": "Chixia fires up fast shots at nearby enemies, dealing Fusion DMG.",
          "skillIcon": "Chixia_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Grand Entrance",
          "skillDesc": "Chixia makes a heroic entrance and fires rapidly with her dual pistols at the target, dealing Fusion DMG.",
          "skillIcon": "Chixia_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Leaping Flames",
          "skillDesc": "Chixia releases a shockwave surrounding the target, dealing Fusion DMG equal to 530% of Chixia's ATK to enemies within the range.",
          "skillIcon": "Chixia_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Scorching Magazine",
          "skillDesc": "Max \"Thermobaric Bullets\" is increased by 10 rounds. The damage of Resonance Skill Boom Boom is increased by 50%.",
          "skillIcon": "Chixia_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Numbingly Spicy!",
          "skillDesc": "Each \"Thermobaric Bullets\" that hits a target during Resonance Skill DAKA DAKA! increases ATK by 1% for 10s, stacking up to 30 times.",
          "skillIcon": "Chixia_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "No.1 Hero Play Fan": "Resonance Skill Boom Boom hits will always be Critical Hits.",
        "Leaping Sparkles": "During Resonance Liberation Blazing Flames, for every 1 target defeated, Chixia recovers 5 Resonance Energy, up to 20 each time.",
        "Eternal Flames": "Resonance Liberation Blazing Flames deals 40% more damage to targets whose HP is below 50%.",
        "Hero's Ultimate Move": "Resonance Liberation Blazing Flames grants 60 \"Thermobaric Bullets\" and immediately resets the Cooldown of Resonance Skill Whizzing Fight Spirit.",
        "Trumphant Explosions": "When the Inherent Skill Numbingly Spicy! reaches max stacks, ATK is additionally increased by 30%.",
        "Easter Egg Performance": "Resonance Skill Boom Boom increased the Basic Attack damage bonus of all team members by 25% for 15s."
      }
    },
    {
      "id": 6,
      "name": "Danjin",
      "rarity": 4,
      "attribute": "Havoc",
      "weapon": "Sword",
      "profile": {
        "info": "With a vengeful blade of condensed blood in hand, Ranger Danjin hunts down thieves and bandits for retribution. She journeys to distant lands in pursuit of justice.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "danjin_icon.png",
        "portrait": "danjin_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Execution",
          "skillDesc": "",
          "skillIcon": "Danjin_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Danjin performs up to 3 consecutive attacks, dealing Havoc DMG.",
            "Heavy Attack": "Danjin consumes STA to launch consecutive attacks, dealing Havoc DMG.",
            "Mid-air Attack": "Consume STA to perform a Mid-air Plunging Attack, dealing Havoc DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to launch an attack, dealing Havoc DMG.",
            "Dodge Counter: Ruby Shades": "After a successful Dodge Counter, Danjin can use Resonance Skill Crimson Fragment to perform Resonance Skill: Crimson Erosion."
          }
        },
        "Forte Circuit": {
          "skillName": "Serene Vigil",
          "skillDesc": "Chaoscleave, dealing Havoc DMG, considered as Heavy Attack damage, and healing Danjin. If current \"Ruby Blossom\" reaches over 120, 120 \"Ruby Blossom\" is consumed instead to increase the damage multiplier of Chaoscleave and Scatterbloom performed this time.",
          "skillIcon": "Danjin_ForteCircuit.webp",
          "skillVars": {
            "Heavy Attack: Scatterbloom": "Use Basic Attack after Heavy Attack Chaoscleave to cast Scatterbloom to attack the target, dealing Havoc DMG, considered as Heavy Attack damage.",
            "Ruby Blossom": "Danjin can hold up to 120 Ruby Blossom.\n- Danjin obtains \"Ruby Blossom\" when using Resonance Skill Crimson Fragment."
          }
        },
        "Resonance Skill": {
          "skillName": "Crimson Fragment",
          "skillDesc": "",
          "skillIcon": "Danjin_ResonanceSkill.webp",
          "skillVars": {
            "Crimson Erosion": "After Basic Attack 2, Dodge Counter or Intro Skill Vindication, use Resonance Skill to perform up to 2 consecutive strikes, dealing Havoc DMG. When Crimson Erosion 2 hits a target, apply Incinerating Will to it.",
            "Incinerating Will": "Danjin's damage dealt to targets marked with Incinerating Will is increased by 20%.",
            "Sanguine Pulse": "Use Resonance Skill after Basic Attack 3 to perform up to 3 consecutive attacks, dealing Havoc DMG."
          }
        },
        "Resonance Liberation": {
          "skillName": "Crimson Bloom",
          "skillDesc": "Danjin's anger intensifies as she frantically swings her dual blades, performing multiple rapid consecutive attacks, and 1 Scarlet Burst attack(s), dealing Havoc DMG.",
          "skillIcon": "Danjin_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Vindication",
          "skillDesc": "With unwavering determination, Danjin unleashes a strike, dealing Havoc DMG.",
          "skillIcon": "Danjin_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Duality",
          "skillDesc": "The incoming character (or a character on a nearby team that activates an Outro Skill) has their Havoc DMG Amplified by 23% for 14s or until they are switched off field.",
          "skillIcon": "Danjin_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Crimson Light",
          "skillDesc": "Damage of Resonance Skill Crimson Erosion triggered by Dodge Counter: Ruby Shades is increased by 20%. The HP cost and stacks of \"Ruby Blossom\" recovered are doubled.",
          "skillIcon": "Danjin_InherentSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Overflow",
          "skillDesc": "After casting the Resonance Skill Sanguine Pulse, Danjin's Heavy Attack damage is increased by 30% for 5s.",
          "skillIcon": "Danjin_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Crimson Heart of Justice": "When Danjin attacks a target with Resonance Skill's Incinerating Will, her ATK is icnreased by 5% for 6s, stacking up to 6 times. Danjin loses 1 stack of this effect each time she takes damage.",
        "Dusted Mirror": "When Danjin attacks a target with Resonance Skill's Incinerating Will, her damage dealt is increased by 20%.",
        "Fleeting Blossom": "Resonance Liberation damage bonus i increased by 30%.",
        "Solitary Carnation": "When Danjin has more than 60 \"Ruby Blossom\", her Crit. Rate is increased by 15%. This effect lasts until the end of Heavy Attack: Scatterbloom even after all \"Ruby Blossom\" is consumed when casting Heavy Attack: Chaoscleave.",
        "Reigning Blade": "Danjin's Havoc DMG bonus i increased by 15%, and further increased by another 15% when her HP is lower than 60%.",
        "Bloodied Jade": "Heavy Attack Chaoscleave increased the ATK of all team members by 20% for 20s."
      }
    },
    {
      "id": 7,
      "name": "Encore",
      "rarity": 5,
      "attribute": "Fusion",
      "weapon": "Rectifier",
      "profile": {
        "info": "A girl accompanied by one black and one white Wooly plushies. Encore, consultant from the Black Shores, is longing to create happy stories with candies, fairy tales, and her imagination.",
        "gender": "Female",
        "birthplace": "New Federation",
        "affiliation": "The Black Shores"
      },
      "image": {
        "icon": "encore_icon.png",
        "portrait": "encore_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Wooly Attack",
          "skillDesc": "",
          "skillIcon": "Encore_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Encore performs up to 4 consecutive attacks, dealing Fusion DMG.",
            "Basic Attack: Wooly Strike": "After Basic Attack 4, press the Basic Attack button to attack the target, dealing Fusion DMG.",
            "Heavy Attack": "Encore consumes STA to attack the target, dealing Fusion DMG.",
            "Mid-air Attack": "Encore consumes STA to perform a Mid-air Plunging Attack, dealing Fusion DMG.",
            "Dodge Counter": "Use Basic Attack after successful Dodge to attack the target, dealing Fusion DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Black & White Woolies",
          "skillDesc": "",
          "skillIcon": "Encore_ForteCircuit.webp",
          "skillVars": {
            "Heavy Attack: Cloudy Frenzy": "When Encore's \"Mayhem\" is full, after casting a Heavy Attack, Encore will consume all \"Mayhem\" to enter the Mayhem state, reducing damage taken by 70%. Switching characters does not interrupt the Mayhem state. After the Mayhem state ends, Encore will cast Cloudy Frenzy, dealing Fusion DMG, considered as Resonance Liberation damage.",
            "Heavy Attack: Cosmos Rupture": "During Cosmos Rave, when casting Heavy Attack, if \"Mayhem is full, Encore will consume all \"Mayhem\" to enter Cosmos' Mayhem state, reducing damage taken by 70%. Switching characters does not interrupt the Cosmos' Mayhem state. After Cosmos' Mayhem state ends, Encore will cast Cosmos Rupture, dealing Fusion DMG, considered as Resonance Liberation damage.",
            "Mayhem": "Encore can hold up to 100 \"Mayhem\".\n- When Normal Attack Wooly Attack hits a target, Encore restores \"Mayhem\".\n- When Resonance Skill Flaming Woolies hits a target, Encore restores \"Mayhem\".\n- When Resonance Skill Energetic Welcome hits a target, Encore restores \"Mayhem\".\n- When Intro Skill Woolies Helpers hits a target, Encore restores \"Mayhem\".\n- During the duration of Resonance Liberation Cosmos Rave, Encore restores \"Mayhem\" when hitting a target."
          }
        },
        "Resonance Skill": {
          "skillName": "Flaming Woolies",
          "skillDesc": "",
          "skillIcon": "Encore_ResonanceSkill.webp",
          "skillVars": {
            "Flaming Woolies": "Encore summons Cloudy and Cosmos to attack with burning rays, dealing Fusion DMG.",
            "Energetic Welcome": "After casting Flaming Woolies, use Resonance Skill to perform Energetic Welcome, dealing Fusion DMG."
          }
        },
        "Resonance Liberation": {
          "skillName": "Cosmos Rave",
          "skillDesc": "As Encore loses control, Cosmos breaks free and wreaks havoc on its surroundings.",
          "skillIcon": "Encore_ResonanceLiberation.webp",
          "skillVars": {
            "Basic Attack: Cosmos - Frolicking": "During Cosmos Rave, the Basic Attack is replaced with Cosmos- Frolicking, which performs up to 4 consecutive attacks, dealing Fusion DMG, considered as Basic Attack damage.",
            "Cosmos - Heavy Attack": "During Cosmos Rave, the Heavy Attack is replaced with Cosmos - Heavy Attack, consuming STA to attack the target, dealing Fusion DMG, considered as Heavy Attack damage.",
            "Resonance Skill: Cosmos - Rampage": "During Cosmos Rave, Flaming Woolies is replaced with Cosmos - Rampage, dealing Fusion DMG, considered as Resonance Skill damage.",
            "Cosmos - Dodge Counter": "During Cosmos Rave, use Basic Attack after a successful Dodge to attack the target, dealing Fusion DMG, considered as Basic Attack damage."
          }
        },
        "Intro Skill": {
          "skillName": "Woolies Helpers",
          "skillDesc": "Encore pounces at the enemies with Cosmos, dealing Fusion DMG.",
          "skillIcon": "Encore_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Thermal Field",
          "skillDesc": "Encore generates a Thermal Field centered around skill target, with a radius of 3m. Targets inside the Thermal Field are continuously burned, suffering Fusion DMG equal to 176.76% of Encore's ATK every 1.5s for 6s.",
          "skillIcon": "Encore_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Angry Cosmos",
          "skillDesc": "During the Resonance Liberation Cosmos Rave, when Encore's HP is above 70%, damage dealt is increased by 10%.",
          "skillIcon": "Encore_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Woolies Cheer Dance",
          "skillDesc": "When Resonance Skill Flaming Woolies or Resonance Skill Cosmos - Rampage is cast, Encore's Fusion DMG bonus is increased by 10% for 10s.",
          "skillIcon": "Encore_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Wooly's Fairy Tale": "When Basic Attack hits a target, Encore's fusion DMG bonus is increased by 3%, stacking up to 4 time(s) for 6s.",
        "Sheep-counting Lullaby": "Encore additionally restores 10 Resonance Energy when casting Basic Attack Woolies Attack or Resonance Skill Energetic Welcome. This can be triggered once every 10s.",
        "Fog? The Black Shores!": "The damage multiplier of Heavy Attack Cloudy Frenzy and Heavy Attack Cosmos Rupture is increased by 40%.",
        "Adventure? Let's go!": "Heavy Attack Cosmos Rupture increased the Fusion DMG bonus of all team members by 20% for 30s.",
        "Hero Takes the Stage!": "Resonance Skill damage bonus is increased by 35%.",
        "Woolies Save the World!": "During Resonance Liberation Cosmos Rave, Encore gains 1 stack(s) of \"Lost Lamb\" every time she deals damage, each stack increased her ATK by 5% for 10s, stacking up to 5 time(s)."
      }
    },
    {
      "id": 8,
      "name": "Jianxin",
      "rarity": 5,
      "attribute": "Aero",
      "weapon": "Gauntlet",
      "profile": {
        "info": "Jianxin, a Taoist monk and successor of Fengyiquan, has dedicated her life to mastering the ultimate martial art. With the power to harness and transform environmental Chi, she can create protective barriers that purify both body and mind.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "jianxin_icon.png",
        "portrait": "jianxin_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Fengyiquan",
          "skillDesc": "",
          "skillIcon": "Jianxin_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Jianxin performs up to 4 consecutive attacks, dealing Aero DMG.",
            "Heavy Attack": "Jianxin consumes STA to attack the target, dealing Aero DMG.",
            "Mid-air Attack": "Jianxin consumes STA to plunge and unleash a powerful kick, dealing Aero DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Aero DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Primordial Chi Spiral",
          "skillDesc": "",
          "skillIcon": "Jianxin_ForteCircuit.webp",
          "skillVars": {
            "Heavy Attack: Primordial Chi Spiral": "When \"Chi\" reaches max stacks, hold Heavy Attack to cast Primordial Chi Spiral and start Zhoutian Progress.",
            "Zhoutian Progress": "Jianxin's resistance to interruption is increased, and her damage taken is reduced by 50%. Jianxin continuously consumes \"Chi\" and casts Chi Strike to attack targets nearby, dealing Aero DMG.\n\nAs Zhoutian Progress accumulates, Jianxin reaches different Zhoutian and gains effects accordingly:\n- Before Minor Zhoutian: Gain Zhoutian Progress 1 shield. When Zhoutian Progress is interrupted, cast Pushing Punch to attack the target, dealing Aero DMG.\n- Minor Zhoutian: Gain Zhoutian Progress 2 shield and cast Shock to attack the target, dealing Aero DMG. When Zhoutian Progress is interrupted, cast Yielding Pull to attack the target, dealing Aero DMG.\n- Major Zhoutian - Inner: Gain Zhoutian Progress 3 shield and cast Shock to attack the target, dealing Aero DMG. When Zhoutian Progress is interrupted, cast Yielding Pull to attack the target, dealing Aero DMG.\n- Major Zhoutian - Outer: Gain Zhoutian Progress 3 shield and cast Shock to attack the target, dealing Aero DMG.\n- When Basic Attack button is released, interrupted Zhoutian Progress and lose all \"Chi\";\n- When all \"Chi\" is consumed, end Zhoutian Progress.\n\nWhen Zhoutian Progress ends, regain a shield according to the Zhoutian Progress reached,. As the shield provided by Heavy Attack: Primordial Chi Spiral persists, the active character is healed once every 6s.",
            "Chi": "Jianxin can hold up to 120 Chi.\n- Chi is obtained when a Normal Attack Fengyiquan hits the target.\n- Chi is obtained when the Resonance Skill Calming Air is cast.\n- Chi is obtained when the Resonance Skills Chi Counter or Chi Parry hits the target.\n- Chi is obtained when the Intro Skill Essence of Tao hits the target."
          }
        },
        "Resonance Skill": {
          "skillName": "Calming Air",
          "skillDesc": "Hold Resonance Skill to enter Parry Stance.",
          "skillIcon": "Jianxin_ResonanceSkill.webp",
          "skillVars": {
            "Chi Counter": "When Jianxin is attacked in the Parry Stance, she does not take damage and immediately performs Chi Counter, dealing Aero DMG.",
            "Chi Parry": "Release the Resonance Skill button during Parry Stance to interrupt Parry Stance and perform Chi Parry, dealing Aero DMG."
          }
        },
        "Resonance Liberation": {
          "skillName": "Purification Force Field",
          "skillDesc": "Create a strong wind field, continuously pulling targets within the wind field to the center and dealing Aero DMG. When the wind field disappears, it will trigger an explosion to deal Aero DMG to all targets within the range again.",
          "skillIcon": "Jianxin_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Essence of Tao",
          "skillDesc": "Pull in targets within the range, dealing Aero DMG.",
          "skillIcon": "Jianxin_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Transcendence",
          "skillDesc": "The incoming character (or a character on a nearby team that activates an Outro Skill) has their Resonance Liberation DMG Amplified by 38% for 14s or until they are switched off field.",
          "skillIcon": "Jianxin_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Formless Release",
          "skillDesc": "Damage of Resonance Liberation Purification Force Field is increased by 20%",
          "skillIcon": "Jianxin_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Reflection",
          "skillDesc": "The Shield obtained with Heavy Attack Primordial Chi Spiral is increased by 20%.",
          "skillIcon": "Jianxin_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Verdant Branchlet": "After casting Intro Skill Essence of Tao, Jianxin gains 100% extra \"Chi\" from Basic Attacks for 10s.",
        "Tao Seeker's Journey": "Resonance Skill Calming Air can be used 1 more time.",
        "Principles of Wuwei": "After staying in the Parry Stance of Resonance Skill Calming Air for 2.5s, Resonance Skill Chi Counter becomes immediately available.",
        "Multitide Reflection": "When performing Forte Circuit Heavy Attack: Primordial Chi Spiral, Jianxin's Resonance Liberation Purification Force Field damage is increased by 80% for 14s.",
        "Mirroring Introspection": "The range of Resonance Liberation Purification Force Field is increased by 33%.",
        "Truth from Within": "During Forte Circuit Heavy Attack: Primordial Qi Spiral, if Jianxin performs Pushing Punch, enhanced Resonance Skill Special Chi Counter can be used 1 time(s) in 5s. Special Chi Counter:\n- Deals Aero DMG equal to 556.67% of Jianxin's ATK, considered as Heavy Attack damage.\n- Obtain a Zhoutian Progress 4 Shield (Benefits from Inherent Skill Reflection's bonus effect)."
      }
    },
    {
      "id": 19,
      "name": "Jinhsi",
      "rarity": 5,
      "attribute": "Spectro",
      "weapon": "Broadblade",
      "profile": {
        "info": "Jinhsi, Magistrate of Jinzhou, gently brightens the hopes of her people, like rays of winter sunlight. As the revered Sentinel's Appointed Resonator, she displays humility and wholeheartedly commits herself to guiding her people towards a brilliant future.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "jinhsi_icon.png",
        "portrait": "jinhsi_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Slash of Breaking Dawn",
          "skillDesc": "",
          "skillIcon": "Jinhsi_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Perform up to 4 consecutive strikes, dealing Spectro DMG.",
            "Heavy Attack": "Perform a charged attack at the cost of Stamina, dealing Spectro DMG.",
            "Mid-air Attack": "Perform a plunging attack while in mid-air at the cost of Stamina, dealing Spectro DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to counterattack, dealing Spectro DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Luminal Synthesis",
          "skillDesc": "",
          "skillIcon": "Jinhsi_ForteCircuit.webp",
          "skillVars": {
            "Incarnation": "While in Incarnation:\n- Alternative Basic Attack \"Incarnation - Basic Attack\" becomes available. Perform up to 4 consecutive strikes, dealing Spectro DMG considered as Resonance Skill damage. The basic attack cycle of this will not be reset. Can be cast in mid-air.\n- Alternative Resonance Skill \"Crescent Divinity\" becomes available. Deal Spectro DMG. Can be cast in mid-air.\n- Alternative Heavy Attack \"Incarnation - Heavy Attack\" becomes available. Attack the target in mid-air at the cost of Stamina, dealing Spectro DMG.\n- Alternative Dodge \"Incarnation - Dodge\" is available while in mid-air. Can be cast multiple times at the cost of Stamina.\n- Alternative Dodge Counter \"Incarnation - Dodge Counter\" becomes available. Deal Spectro DMG. Can be cast mid-air.",
            "Resonance Skill - Illuminous Epiphany": "After Stage 4 of \"Incarnation - Basic Attack\", Incarnation terminates and Jinhsi gains Ordination Glow. Can be cast mid-air.\n\nWhile Ordination Glow lasts:\n- Basic Attack is replaced with Heavy Attack \"Incarnation - Heavy Attack\". Attack the target in mid-air at the cost of Stamina, dealing Spectro DMG.\n- Resonance Skill is replaced with Resonance Skill \"Illuminous Epiphany\". Send out Solar Flare that detonates as Stella Glamor, dealing Spectro DMG after a short delay. Consume up to 50 Incandescence, with each point of Incandescence granting bonus damage multiplier percentage to Stella Glamor. Can be cast in mid-air.\n- After casting Resonance Skill Illuminous Epiphany, Jinhsi gains Unison. This can be triggered once every 25s.",
            "Unison": "While Jinhsi has Unison, switching to other Resonators will remove Jinhsi's Unison to trigger Jinhsi's Outro Skill and the incoming Resonator's Intro Skill. Unison will be consumed in priority in place of Concerto Energy when Concerto Energy is full.",
            "Incandescence": "Jinhsi can hold up to 50 Incandescence.\nWhen Jinhsi is in the party, all nearby Resonators in the party gain Eras in Unity. Eras in Unity provides 2 independent effects:\n- Jinhsi gains 1 Incandescence anytime Resonators in the party inflict Attribute damage. This effect may be triggered by damage of the same Attribute for up to 1 time(s) every 3s.\n- Additionally, Jinhsi gains 2 Incandescence when Resonators in the party damage the enemy with Coordinated Attacks. This effect may be triggered by Coordinated Attacks of the same Attribute for up to 1 time(s) every 3s."
          }
        },
        "Resonance Skill": {
          "skillName": "Trailing Lights of Eons",
          "skillDesc": "Dash forward and perform consecutive strikes that inflict Spectro DMG.",
          "skillIcon": "Jinhsi_ResonanceSkill.webp",
          "skillVars": {
            "Overflowing Radiance": "After Jinhsi uses Basic Attack 4 or, while not in Incarnation, Intro Skill Loong's Halo, an alternative Resonance Skill Overflowing Radiance is available within 5s. Resonance Skill Overflowing Radiance inflicts Spectro DMG and sends Jinhsi into Incarnation. Can be cast in mid-air."
          }
        },
        "Resonance Liberation": {
          "skillName": "Purge of Light",
          "skillDesc": "Unleash the power of invocation to deal Spectro DMG. Can be cast in mid-air.",
          "skillIcon": "Jinhsi_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Loong's Halo",
          "skillDesc": "Attack the target, dealing Spectro DMG.",
          "skillIcon": "Jinhsi_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Temporal Bender",
          "skillDesc": "Summoning the power homologous with the Sentinel, Jinhsi may now gain Incandescence via Eras in Unity from damage of the same Attribute more ffectively, at 1 time(s) every 1s for 20s.",
          "skillIcon": "Jinhsi_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Radiant Surge",
          "skillDesc": "",
          "skillIcon": "Jinhsi_InherentSkill1.webp",
          "skillVars": {
            "Incarnation": "Jinhsi's Spectro DMG bonus is increased by 20%."
          }
        },
        "Inherent Skill 2": {
          "skillName": "Converged Flash",
          "skillDesc": "Damage multiplier of Intro Skill Loong's Halo is increased by 50%.",
          "skillIcon": "Jinhsi_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Abyssal Ascension": "When casting Basic Attack \"Incarnation - Basic Attack\" or Resonance Skill Crescent Divinity, Jinhsi gains one stack of Herald of Revival, stacking up to 4 times and lasting for 6s. When casting Resonance Skill Illuminous Epiphany, Jinhsi consumes all stacks of Herald of Revival. Each stack increases the damage of Resonance Skill Illuminous Epiphany by 20%.",
        "Chronofrost Respose": "Jinhsi restores 50 Incandescence while staying out of combat for more than 4s. This effect can only be triggered 1 time(s) every 4s.",
        "Celestial Incarnate": "Jinhsi gains one stack of Immortal's Descendancy after casting Intro Skill Loong's Halo. Each stack of Immortal's Descendancy increases Jinhsi's ATK by 25%, stacking up to 2 time(s) and lasting for 20s.",
        "Benevolent Grace": "When Jinhsi casts Resonance Liberation Purge of Light or Resonance Skill Illuminous Epiphany, all nearby Resonators on the team gain 20% Attribute damage bonus for 20s.",
        "Frostfire Illumination": "The damage multiplier of Resonance Liberation Purge of Light is increased by 120%",
        "Thawing Triumph": "The damage multiplier of Resonance Skill Illuminous Epiphany is increased by 45% and the additional damage multiplier gained by consuming Incandescence is increased by 45%."
      }
    },
    {
      "id": 16,
      "name": "Jiyan",
      "rarity": 5,
      "attribute": "Aero",
      "weapon": "Broadblade",
      "profile": {
        "info": "Jiyan, leader of the Midnight Rangers, acts with swift and resolute righteousness. He possesses the formidable ability to conjure a powerful Qingloong from the winds, making him invincible on the battlefield.",
        "gender": "Male",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "jiyan_icon.png",
        "portrait": "jiyan_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Lone Lance",
          "skillDesc": "",
          "skillIcon": "Jiyan_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Jiyan performs up to 5 consecutive attacks, dealing Aero DMG.",
            "Heavy Attack": "Jiyan consumes Stamina to thrust forward, dealing Aero DMG.",
            "Heavy Attack: Windborne Strike": "Hold the Basic Attack during Heavy Attack to cast Windborne Strike after the Heavy Attack ends, dealing Aero DMG.",
            "Heavy Attack: Abyssal Slash": "Release the Basic Attack during the Heavy Attack to cast Abyssal Slash after the Heavy Attack ends, dealing Aero DMG.",
            "Mid-air Attack": "Jiyan consumes Stamina to perform a Mid-air Plunging Attack, dealing Aero DMG. After the Plunging Attack, use Basic Attack to perform a follow-up attack, dealing Aero DMG.",
            "Mid-air Attack: Banner of Triumph": "After casting the Heavy Attack Windborne Strike or the Resonance Skill Windqueller in the air, Jiyan can perform a mid-air attack, dealing Aero DMG.",
            "Dodge Counter": "Use a Basic Attack after a successful Dodge to attack the target, dealing Aero DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Qingloong at War",
          "skillDesc": "When casting Resonance Skill Windqueller, if Jiyan has 30 or more \"Resolve\", he consumes 30 \"Resolve\" to increase the damage of this Resonance Skill Windqueller by 20%. When Jiyan is in Qingloong Mode, DMG of Resonance Skill Windqueller is increased by 20% and no longer consumes \"Resolve\".",
          "skillIcon": "Jiyan_ForteCircuit.webp",
          "skillVars": {
            "Resonance Liberation: Emerald Storm: Finale": "When casting Resonance Liberation Emerald Storm: Prelude, if Jiyan has 30 \"Resolve\" or more, he will consume 30 \"Resolve\" to cast Emerald Storm: Finale, dealing Aero DMG, considered as Heavy Attack damage. Emerald Storm: Finale can be cast in mid-air at low altitude.",
            "Resolve": "Jiyan can hold up to 60 Resolve.\n- Jiyan gains \"Resolve\" when his Normal Attack Lone Lance hits the target.\n- Jiyan gains \"Resolve\" when the Intro Skill Tactical Strike hits the target. If Jiyan does not hit a target within 15s, his \"Resolve\" will gradually decrease."
          }
        },
        "Resonance Skill": {
          "skillName": "Windqueller",
          "skillDesc": "Dash forward a certain distance, dealing Aero DMG. Can be cast in the air.",
          "skillIcon": "Jiyan_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Emerald Storm: Prelude",
          "skillDesc": "After releasing Emerald Storm: Prelude, Jiyan enters Qingloong Mode.",
          "skillIcon": "Jiyan_ResonanceLiberation.webp",
          "skillVars": {
            "Qingloong Mode": "Jiyan has increased Anti-interruption; Basic Attack, Heavy Attack and Dodge Counter are replaced with Heavy Attack Lance of Qingloong.",
            "Heavy Attack: Lance of Qingloong": "Perform up to 3 continuous attacks, dealing Aero DMG, considered as Heavy Attack damage."
          }
        },
        "Intro Skill": {
          "skillName": "Tactical Strike",
          "skillDesc": "Jiyan pierces the target in mid-air, dealing Aero DMG.",
          "skillIcon": "Jiyan_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Discipline",
          "skillDesc": "When the next character's (or other characters on a nearby team that activates an Outro Skill) Heavy Attack hits a target, Jiyan will summon Qingloong to launch a Coordinated Attack, dealing Aero DMG equal to 313.40% of Jiyan's ATK. This attack lasts for 8s, and can be triggered once every 1s, up to 2 times.",
          "skillIcon": "Jiyan_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Heavenly Balance",
          "skillDesc": "After casting the Intro Skill Tactical Strike, Jiyan's ATK is increased by 10% for 15s.",
          "skillIcon": "Jiyan_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Wind Gathering",
          "skillDesc": "When Jiyan's attacks hit a target, Jiyan's Crit. DMG is increased by 12% for 8s.",
          "skillIcon": "Jiyan_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Benevolence": "Resonance Skill Windqueller can be used 1 more time. When casting Resonance Skill Windqueller, the \"Resolve\" cost is decreased by 15.",
        "Versatility": "After casting Intro Skill Tactical Strike, Jiyan gains 30 \"Resolve\" and his ATK is increased by 28% for 15s. This can be triggered once every 15s.",
        "Spectation": "When casting Resonance Skill Windqueller, Resonance Liberation Emerald Storm: Prelude, Resonance Skill Emerald Storm: Finale or Intro Skill Tactical Strike, Jiyan's Crit. Rate is increased by 16% and Crit. DMG is increased by 32% for 8s.",
        "Prudence": "When casting Resonance Liberation Emerald Storm: Prelude or Resonance Liberation Emerald Storm: Finale, the Heavy Attack damage bonus of all team members is increased by 25% for 30s.",
        "Resolution": "Outro Skill Discipline gains an additional damage multiplier of 120%. When Jiyan's attacks hits a target, his ATK is increased by 3% for 8s, stacking up to 15 times; this effect is immediately maxed after he casts Intro Skill Tactical Strike.",
        "Fortitude": "Every time Heavy Attack, Intro Skill Tactical Strike or Resonance Skill Windqueller is used, Jiyan gains 1 stack(s) of \"Momentum\", stacking up to 2 times. Resonance Liberation Emerald Storm: Finale will consume all \"Momentum\", and each stack consumed increases the damage multiplier of Resonance Lbieration Emerald Storm: Finale by 120%."
      }
    },
    {
      "id": 9,
      "name": "Lingyang",
      "rarity": 5,
      "attribute": "Glacio",
      "weapon": "Gauntlet",
      "profile": {
        "info": "Lingyang is talented and friendly member of the Liondance Troupe in Jinzhou. His passion and courage are evident as he engages with humans, showcasing his impressive physical abilities. With his unique style, he embodies the spirit of Liondancing.",
        "gender": "Male",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "lingyang_icon.png",
        "portrait": "lingyang_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Majestic Fists",
          "skillDesc": "",
          "skillIcon": "Lingyang_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Lingyang performs up to 5 consecutive attacks, dealing Glacio DMG.",
            "Basic Attack: Feral Roars": "After Resonance Skill Furious Punches is cast, Basic Attack 5 is replaced with Feral Roars, dealing Glacio DMG.",
            "Heavy Attack": "Lingyang consumes Stamina to attack the target, dealing Glacio DMG.",
            "Mid-air Attack": "Lingyang consumes Stamina to perform a Mid-air Plunging Attack, dealing Glacio DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Glacio DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Unification of Spirits",
          "skillDesc": "",
          "skillIcon": "Lingyang_ForteCircuit.webp",
          "skillVars": {
            "Heavy Attack: Glorious Plunge": "When Lion's Spirit is full, use Heavy Attack to perform Glorious Plunge, dealing Glacio DMG.",
            "Mid-air Attack: Tail Strike": "When Lion's Spirit is not full, use Basic Attack after Heavy Attack to perform Tail Strike, dealing Glacio DMG.",
            "Striding Lion": "After casting Heavy Attack Glorious Plunge, enter Striding Lion state; After casting Intro Skill Lion Awakens or Resonance Liberation Strive: Lion's Vigor, if \"Lion's Spirit\" is full, use Basic Attack to enter Striding Lion state.\n\nIn the Striding Lion state:\n- Attacks can be launched in mid-air. If Lingyang is on the ground, use Heavy Attack Glorious Plunge to get back in the air.\n- \"Lion's Spirit\" is continuously consumed before running out in 5s, and when it runs out, Striding Lion ends;\n- If Lingyang is in the Resonance Liberation Lion's Vigor state, the consumption speed of \"Lion's Spirit\" is reduced by 50%, extending Striding Lion state by up to 10s.\n- Lingyang's Basic Attack is replaced with Basic Attack Feral Gyrate, which performs up to 2 consecutive attacks, dealing Glacio DMG;\n- Lingyang's Resonance Skill is replaced with Mountain Roamer, dealing Glacio DMG;\n- When \"Lion's Spirit\" is less than 10, use Basic Attack to perform Stormy Kicks, dealing Glacio DMG; after performing Basic Attack Stormy Kicks, the Mid-air Attack Tail Strike becomes available.\n\nConcerto Energy is restored when \"Lion's Spirit\" is consumed.",
            "Lion's Spirit": "Lingyang can hold up to 100 \"Lion's Spirit\".\n- When casting Resonance Skill Furious Punches, \"Lion's Spirit\" is restored.\n- When casting Intro Skill Lion Awakens, \"Lion's Spirit\" is restored.\n- When casting Resonance Liberation Strive: Lion's Vigor, \"Lion's Spirit\" is restored."
          }
        },
        "Resonance Skill": {
          "skillName": "Ancient Arts",
          "skillDesc": "",
          "skillIcon": "Lingyang_ResonanceSkill.webp",
          "skillVars": {
            "Ancient Arts": "Attack the target, dealing Glacio DMG.",
            "Furious Punches": "When Basic Attacks 3, 4, or 5 or Basic Attack Feral Roars hits the target, Resonance Skill Ancient Arts is replaced with Resonance Skill Furious Punches. Lingyang's Basic Attack cycle starts from Basic Attack 3 after casting Basic Attack Feral Roars and Resonance Skill Furious Punches in turn.\n\nLingyang's Resonance Skill does not reset his Basic Attack cycle."
          }
        },
        "Resonance Liberation": {
          "skillName": "Strive: Lion's Vigor",
          "skillDesc": "Attack the target, dealing Glacio DMG, and receive the blessing of Lion's Vigor.",
          "skillIcon": "Lingyang_ResonanceLiberation.webp",
          "skillVars": {
            "Lion's Vigor": "Lingyang's Glacio DMG bonus is increased by 50%."
          }
        },
        "Intro Skill": {
          "skillName": "Lion Awakens",
          "skillDesc": "Lingyang enters the battlefield, dealing Glacio DMG.",
          "skillIcon": "Lingyang_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Frosty Marks",
          "skillDesc": "Lingyang releases a shockwave centered on the skill target, dealing Glacio DMG equal to 587.94% of Lingyang's ATK to targets within the range.",
          "skillIcon": "Lingyang_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Lion's Pride",
          "skillDesc": "Damage of the Intro Skill Lion Awakens is increased by 50%.",
          "skillIcon": "Lingyang_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Diligent Practice",
          "skillDesc": "Under the Forte Circuit Striding Lion state, within 3s after each Basic Attack, the next Forte Circuit Mountain Roamer will deal additional Glacio DMG, equal to 150% of Mountain Roamer damage, considered as Resonance Skill damage",
          "skillIcon": "Lingyang_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Lion of Light, Blessings Abound": "During Resonance Liberation Lion's Vigor, Lingyang's Anti-Interruption is enhanced.",
        "Dominant and Fierce, Power Unbound": "Intro Skill Lion Awakens additionally recovers 10 Resonance Energy for Lingyang, triggered once every 20s.",
        "Jaw-Dropping Feats, Loud and Wide": "During Resonance Liberation Lion's Vigor, Lingyang's Basic Attack damage bonus is increased by 20%, and Resonance Skill damage bonus is increased by 10%.",
        "Immortals Bow, in Reverence Flawed": "Outro Skill Frosty Marks increases the Glacio DMG bonus of all team members by 20% for 30s.",
        "Seven Stars Shine, Stepped upon High": "Resonance Liberation Strive: Lion's Vigor additionally deals Glacio DMG equal to 200% of Lingyang's ATK.",
        "Demons Tremble, Divine Power Night": "In the Forte Circuit Striding Lion state, during the first 3s after every Resonance Skill Mountain Roamer, the Basic Attack damage bonus for Lingyang's next Basic Attack is increased by 100%."
      }
    },
    {
      "id": 10,
      "name": "Mortefi",
      "rarity": 4,
      "attribute": "Fusion",
      "weapon": "Pistols",
      "profile": {
        "info": "Mortefi, a skilled expert in Applied Tacetite Study and a member of the Academy's Department of safety, possesses the unique ability to transform his accumulated frustration into fiery flames. From a burning wrath that consumes all, the red dragon shall descend.",
        "gender": "Male",
        "birthplace": "New Federation",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "mortefi_icon.png",
        "portrait": "mortefi_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Impromptu Show",
          "skillDesc": "",
          "skillIcon": "Mortefi_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Mortefi uses his dual pistols and flames to perform up to 4 consecutive shots, dealing Fusion DMG.",
            "Heavy Attack": "Mortefi enters the aiming state for a more powerful shot. The aimed shot fired after charging finishes deals Fusion DMG.",
            "Mid-air Attack": "Mortefi consumes STA to perform consecutive shots at the target in mid-air, dealing Fusion DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Fusion DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Fury Fugue",
          "skillDesc": "",
          "skillIcon": "Mortefi_ForteCircuit.webp",
          "skillVars": {
            "Resonance Skill: Fury Fugue": "When Mortefi's \"Annoyance\" reaches 100, his Reosnance Skill is replaced with Fury Fudge. When casting Fury Fudge, Mortefi consumes all \"Annoyance\" to unleash high-speed flame lightning, dealing Fusion DMG, considered as Resonance Skill damage.",
            "Annoyance": "Mortefi can hold up to 100 Annoyance.\n- When Normal Attack Impromptu Show hits the target, \"Annoyance\" is restored.\n- When Intro Skill Dissonance hits the target, \"Annoyance\" is restored.\n- When Resonance Skill Passionate Variation hits the target, \"Annoyance\" is restored.\n- Within 5s after casting Passionate Variation, Basic Attack Impromptu Show that hits the target additionally restores \"Annoyance\"."
          }
        },
        "Resonance Skill": {
          "skillName": "Passionate Variation",
          "skillDesc": "Launch a flashing lightning of flames forward, dealing Fusion DMG.",
          "skillIcon": "Mortefi_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Violent Finale",
          "skillDesc": "Deal Fusion DMG, and apply Burning Rhapsody to all characters on the team.",
          "skillIcon": "Mortefi_ResonanceLiberation.webp",
          "skillVars": {
            "Burning Rhapsody": "- When the active character's Basic Attack hits the target, Mortefi launches a Coordinated Attack, firing 1 Marcato.\n- When the active character's Heavy Attack hits the target, Mortefi launches a Coordinated Attack, firing 2 Marcato.\n\nMortefi can launch one Coordinated Attack every 0.35s."
          }
        },
        "Intro Skill": {
          "skillName": "Dissonance",
          "skillDesc": "Attack the target, dealing Fusion DMG.",
          "skillIcon": "Mortefi_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Rage Transposition",
          "skillDesc": "The incoming Resonator (or Resonator on a nearby team that activates Outro Skill) has their Heavy Attack damage amplified by 38% for 14s or until they are switched off field.",
          "skillIcon": "Mortefi_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Harmonic Control",
          "skillDesc": "After casting Resonance Skill Passionate Variation, the damage of Resonance Skill Fury Fugue is increased by 25% for 8s.",
          "skillIcon": "Mortefi_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Rhythmic Vibrato",
          "skillDesc": "During Resonance Liberation Burning Rhapsody, each hit of Resonance Liberation Marcato will increase the damage of the next Resonance Liberation Marcato by 1.5%, which can be triggered once every 0.35s, stacking up to 50 times. The effect will be reset after Resonance Liberation Burning Rhapsody ends.",
          "skillIcon": "Mortefi_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Solitary Etude": "During Resonance Liberation Burning Rhapsody, Mortefi launches Coordinated Attacks when the on-field character performs thei Resonance Skills, firing 2 Resonance Liberation's Marcato hits, dealing Fusion DMG.",
        "Hypocritical Hymn": "After using the Echo Skill, Mortefi restores an additional 10 Resonance Energy. This can be triggered once every 20 seconds.",
        "Flaming Recitativo": "During Resonance Liberation Burning Rhapsody, the Crit. DMG of Resonance Liberation's Marcato is increased by 30%.",
        "Cathartic Waltz": "The duration of Resonance Liberation Burning Rhapsody is extended by 7s.",
        "Funerary Quartet": "When Resonance Skill Passionate Variation or Resonance Skill Fury Fugue hits a target, Coordinated Attacks will be triggered to fire 4 Resonance Liberation's Marcato hit(s), dealing Fusion DMG. Damage of Resonance Liberation's Marcato fired in this way is reduced by 50%.",
        "Apoplectic Instrumental": "When Resonance Liberation Violent Finale is cast, ATK of all team members is increased by 20% for 20s."
      }
    },
    {
      "id": 18,
      "name": "Rover (Havoc)",
      "rarity": 5,
      "attribute": "Havoc",
      "weapon": "Sword",
      "profile": {
        "info": "?",
        "gender": "?",
        "birthplace": "?",
        "affiliation": "?"
      },
      "image": {
        "icon": "roverM_icon.png",
        "portrait": "roverM_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Tuneslayer",
          "skillDesc": "",
          "skillIcon": "RoverH_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Rover-Havoc performs up to 5 consecutive attacks, dealing Havoc DMG.",
            "Heavy Attack": "Rover-Havoc consumes STA to attack, dealing Havoc DMG. Use Basic Attack after casting Heavy Attack to cast Basic Attack 4.",
            "Mid-air Attack": "Rover-Havoc consumes STA to cast a Mid-air Plunging Attack, dealing Havoc DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Havoc DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Umbra Eclipse",
          "skillDesc": "",
          "skillIcon": "RoverH_ForteCircuit.webp",
          "skillVars": {
            "Devastation": "When \"Umbra\" is full, hold Basic Attack to cast Devastation to attack the target, dealing Havoc DMG, considered as Heavy Attack damage.",
            "Dark Surge": "After casting Devastation, Rover enters the Dark Surge state. In this state:\n- Basic Attack is replaced with Enhanced Basic Attack, which performs up to 5 consecutive attacks, dealing Havoc DMG;\n- Heavy Attack is replaced with Enhanced Heavy Attack;\n- Use Basic Attack after casting Enhanced Heavy Attack to cast Heavy Attack Thwackblade to attack the target, dealing Havoc DMG, considered as Heavy Attack damage;\n- Use Basic Attack after casting Heavy Attack Thwackblade to cast Enhanced Basic Attack 3 to attack the target, dealing Havoc DMG;\n- Resonance Skill Wingblade is replaced with Resonance Skill Lifetaker, transforming sounds into blades to attack the target, dealing Havoc DMG.",
            "Umbra": "Rover can hold up to 100 points of Umbra.\n- Normal Attack Tuneslayer recovers Umbra on hit.\n- Resonance Skill Wingblade recovers Umbra when cast.\n- Resonance Skill Lifetaker recovers Umbra when cast.\n- Intro Skill Instant of Annihilation recovers Umbra when cast."
          }
        },
        "Resonance Skill": {
          "skillName": "Wingblade",
          "skillDesc": "Transform sound into feathers, dealing Havoc DMG.",
          "skillIcon": "RoverH_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Deadening Abyss",
          "skillDesc": "Rover gathers resonating sounds to attack a target, dealing Havoc DMG.",
          "skillIcon": "RoverH_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Instant of Annihilation",
          "skillDesc": "Attack the target, dealing Havoc DMG.",
          "skillIcon": "RoverH_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Soundweaver",
          "skillDesc": "Rover summons a Havoc Field, dealing Havoc DMG equal to 143.3% of Rover's ATK to all targets within range every 2s for 6s.",
          "skillIcon": "RoverH_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Metamorph",
          "skillDesc": "In the Dark Surge state, Havoc DMG bonus is increased by 20%.",
          "skillIcon": "RoverH_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Bleak Crescendo",
          "skillDesc": "While in the Dark Surge state, Basic Attack recovers 1 extra Resonance Energy when it hits a target, and this effect can be triggered 1 time per second.",
          "skillIcon": "RoverH_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Cryptic Insight": "Resonance Skill damage bonus is increased by 30%.",
        "Waning Crescent": "Reset Resonance Skill's Cooldown when Rover enters the Dark Surge state by casting Heavy Attack Devastation.",
        "Surging Resonance": "In the Dark Surge state, Basic Attack 5 restores HP equal to 10% of total HP lost on hit.",
        "Annihilated Silence": "Heavy Attack Devastation and Resonance Liberation Deadening Abyss reduces enemy Havoc resistance by 10% for 20s on hit.",
        "Aeon Symphony": "In the Dark Surge state, Basic Attack 5 deals additional Havoc DMG equal to 50% of Basic Attack 5 damage.",
        "Ebbing Undercurrent": "In the Dark Surge state, Rover's Crit. Rate is increased by 25%."
      }
    },
    {
      "id": 1,
      "name": "Rover (Spectro)",
      "rarity": 5,
      "attribute": "Spectro",
      "weapon": "Sword",
      "profile": {
        "info": "?",
        "gender": "?",
        "birthplace": "?",
        "affiliation": "?"
      },
      "image": {
        "icon": "roverM_icon.png",
        "portrait": "roverM_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Vibration Manifestation",
          "skillDesc": "",
          "skillIcon": "RoverS_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Rover performs up to 4 consecutive attacks, dealing Spectro DMG.",
            "Heavy Attack": "Rover consumes STA to attack the target, dealing Spectro DMG.",
            "Heavy Attack: Resonance": "After Basic Attack 3 or Heavy Attack, press the Basic Attack button at the right time to perform Heavy Attack Resonance, dealing Spectro DMG.",
            "Heavy Attack: Aftertune": "After Heavy Attack Resonance or Dodge Counter hits a target, press the Basic Attack button to perform Heavy Attack Aftertune, dealing Spectro DMG.",
            "Mid-air Attack": "Rover consumes STA to perform a Mid-air Plunging Attack, dealing Spectro DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Spectro DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "World in a Grain of Sand",
          "skillDesc": "",
          "skillIcon": "RoverS_ForteCircuit.webp",
          "skillVars": {
            "Resonance Skill: Resonating Spin": "If \"Diminutive Sound\" exceeds 50 when Resonance Skill is used, Rover consumes 50 \"Diminutive Sound\" to cast Resonating Spin, dealing Spectro DMG, considered as Resonance Skill damage.",
            "Basic Attack: Resonating Echoes": "After Resonance Skill Resonating Spin ends, Rover performs Resonating Echoes upon using Basic Attack. Launch attacks forward, dealing Spectro DMG, considered as Resonance Skill DMG.",
            "Diminutive Sound": "Rover can hold up to 100 \"Diminutive Sounds\".\n- Rover obtains \"Diminutive Sound\" for every Normal Attack Vibration Manifestation on hit.\n- Rover obtains \"Diminutive Sound\" for every Heavy Attack Aftertune on hit.\n- Rover obtains \"Diminutive Sound\" upon casting Intro Skill Waveshock."
          }
        },
        "Resonance Skill": {
          "skillName": "Resonating Slashes",
          "skillDesc": "Rover launches an attack forward, dealing Spectro DMG.",
          "skillIcon": "RoverS_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Echoing Orchestra",
          "skillDesc": "Rover converges Spectro energy to assail the target area, detonating it after a short delay and dealing Spectro DMG.",
          "skillIcon": "RoverS_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Waveshock",
          "skillDesc": "Rover attacks the target, dealing Spectro DMG.",
          "skillIcon": "RoverS_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Instant",
          "skillDesc": "Generate an area of stasis surrounding the next character (or a character on a nearby team that activates an Outro Skill), lasting for 3s.",
          "skillIcon": "RoverS_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Reticence",
          "skillDesc": "Damage dealt by Rover's Basic Attack Resonating Echoes is increased by 60%.",
          "skillIcon": "RoverS_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Silent Listener",
          "skillDesc": "Rover gains 15% ATK increase for 5s upon casting Heavy Attack Resonance.",
          "skillIcon": "RoverS_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Odyssey of Beginnings": "Rover's Crit. Rate is increased by 15% for 7s when casting Resonance Skill Resonating Slashes or Resonance Skill Resonanting Spin.",
        "Microcosmic Murmurs": "Rover's Spectro DMG bonus is increased by 20%.",
        "Visages of Dust": "Rover's Energy Regen is increased by 20%.",
        "Resonating Lamella": "When casting Resonance Liberation Echoing Resonance, Rover continuously restores HP for all team members: HP equal to 20% of Rover's ATK will be restored every second for 5s.",
        "Temporal Virtuoso": "Rover's Resonance Liberation damage bonus is increased by 40%.",
        "Echoes of Wanderlust": "Resonance Skill Resonating Slashes and Resonance Skill Resonating Spin reduces the target's Spectro DMG resistance by 10% on hit for 20s."
      }
    },
    {
      "id": 11,
      "name": "Sanhua",
      "rarity": 4,
      "attribute": "Glacio",
      "weapon": "Sword",
      "profile": {
        "info": "The bodyguard of Jinzhou's Magistrate, known for having an icy personality. Once regarded as the Asura of Calamity, Sanhua is now a taciturn guardian. She has learned to maintain inner calmness amidst the chaotic frequencies, and the things that once frightened her now fuel her determination.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "sanhua_icon.png",
        "portrait": "sanhua_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Frigid Light",
          "skillDesc": "",
          "skillIcon": "Sanhua_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Sanhua performs up to 5 consecutive attacks, dealing Glacio DMG.",
            "Heavy Attack": "Sanhua consumes STA to launch attacks, dealing Glacio DMG.",
            "Mid-air Attack": "Sanhua consumes STA to perform a Mid-air Plunging Attack, dealing Glacio DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Glacio DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Clarity of Mind",
          "skillDesc": "",
          "skillIcon": "Sanhua_ForteCircuit.webp",
          "skillVars": {
            "Heavy Attack: Detonate": "When holding Basic Attack, a cursor moves back and forth on the Forte Gauge. Release Basic Attack while the cursor falls in the \"Frostbite\" area to perform Heavy Attack Detonate, dealing Glacio DMG considered as Heavy Attack damage.",
            "Ice Burst": "Sanhua's Heavy Attack Detonate detonates all \"Ice Thorns\", \"Ice Prisms\" and \"Glaciers\" within her attack range, dealing Glacio DMG. Ice Burst deals Resonance Skill DMG.",
            "Frostbite Area": "The \"Frostbite\" area expands with every 1 stack of \"Clarity\". Clarity stacks up to 2 times.\n- Sanhua obtains 1 stack of Clarity upon performing Basic Attack 5.\n- Sanhua obtains 1 stack of Clarity upon casting Intro Skill Freezing Thorns.\n- Sanhua obtains 1 stack of Clarity upon casting Resonance Skill Eternal Frost.\n- Sanhua obtains 2 stacks of Clarity upon casting Resonance Liberation Glacial Gaze.\n\n Upon casting Heavy Attack Detonate, all \"Clarity\" is removed."
          }
        },
        "Resonance Skill": {
          "skillName": "Eternal Frost",
          "skillDesc": "Sanhua sends an air blade to create 1 \"Ice Prism\" on the ground, dealing Glacio DMG.",
          "skillIcon": "Sanhua_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Glacial Gaze",
          "skillDesc": "Sanhua deals Glacio DMG and creates 1 \"Glacier\".",
          "skillIcon": "Sanhua_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Freezing Thorns",
          "skillDesc": "Sanhua swings her blade downward and creates 1 \"Ice Thorn\", dealing Glacio DMG.",
          "skillIcon": "Sanhua_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Silversnow",
          "skillDesc": "The incoming Resonator (or Resonator on a nearby team that activates Outro Skill) has their Basic Attack damage amplified by 38% for 14s or until they are switched off field.",
          "skillIcon": "Sanhua_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Condensation",
          "skillDesc": "Damage dealt by Sanhua's Resonance Skill increased by 20% for 8s after casting her Intro Skill.",
          "skillIcon": "Sanhua_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Avalanche",
          "skillDesc": "Damage dealt by Sanhua's Forte Circuit Ice brust is increased by 20% for 8s after casting Basic Attack 5.",
          "skillIcon": "Sanhua_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Solitude's Embrace": "Basic Attack 5 increases Sanhua's Crit. Rate by 15% for 10s.",
        "Snowy Clarity": "Stamina cost of Heavy ATtack Detonate is reduced by 10. When Sanhua casts Resonance Skill Eternal Frost, her Anti-interruption is enhanced for 10s.",
        "Anomalous Vision": "Sanhua's damage dealt is increased by 35% against targets with HP below 70%.",
        "Blade Mastery": "Resonance Liberation Glacial Gaze restores 10 Resonance Energy. Damage of the next Heavy Attack Detonate within 5s is increased by 120%.",
        "Unraveling Fate": "Crit. DMG of Forte Circuit Ice Burst is increased by 100%. Ice Creations (Ice Thorn, Ice Prism, and Glacier) will explode even if they are not detonated.",
        "Daybreak Radiance": "After an Ice Prism or a Glacier is detonated, all team members' ATK is increased by 10% for 20s, stacking up to 2 times."
      }
    },
    {
      "id": 12,
      "name": "Taoqi",
      "rarity": 4,
      "attribute": "Havoc",
      "weapon": "Broadblade",
      "profile": {
        "info": "Taoqi is the director of border defense at the Ministry of Development. Despite her seemingly laid-back demeanor, she consistently proves to be a dependable and supportive individual, always lending her hand to those in need. Taoqi is not only a reliable colleague, but also a trustworthy friend that people can confide in.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "taoqi_icon.png",
        "portrait": "taoqi_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Concealed Edge",
          "skillDesc": "",
          "skillIcon": "Taoqi_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Taoqi performs up to 4 continuous attacks, dealing Havoc DMG.",
            "Heavy Attack": "Taoqi consumes STA to deal Havoc DMG. If Basic Attack button is held, Taoqi enters Rocksteady Defense state.",
            "Rocksteady Defense": "Taoqi's damage taken is reduced by 35%;\n- When Taoqi is attacked during Rocksteady Defense, she will cast Strategic Parry;\n- Strategic Parry is automatically cast after Rocksteady Defense lasts for 3s;\n- If Taoqi is attacked when casting Resonance Skill Rocksteady Shield, Strategic Parry is automatically cast.",
            "Strategic Parry": "Taoqi attacks the target, dealing Havoc DMG.",
            "Mid-air Attack": "Taoqi consumes STA to perform a Mid-air Plunging Attack, dealing Havoc DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Havoc DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Power Shift",
          "skillDesc": "",
          "skillIcon": "Taoqi_ForteCircuit.webp",
          "skillVars": {
            "Timed Counters": "When carrying \"Resolving Caliber\", use Basic Attack after Heavy Attack Strategic Parry or Intro Skill Defense Formation to cast Timed Counters, performing up to 3 consecutive attacks, dealing Havoc DMG, considered as Basic Attack damage.\n- Timed Counters consume 1 \"Resolving Caliber\" upon hitting an enemy to grant a shield.\n- After casting the Intro Skill Defense Formation, use Basic Attack to directly cast Timed Counters.",
            "Resolving Caliber": "Taoqi can hold up to 3 Resolving Caliber.\n- Basic Attack 4 will consume all of Taoqi's \"Rocksteady Shields\" to grant that many \"Resolving Caliber\".\n- While Rocksteady Shield exists, when the active character is attacked, 1 \"Rocksteady Shield\" will be consumed to recover \"Resolving Caliber\".\n- After Rocksteady Shield ends, all remaining \"Rocksteady Shield\" will be consumed to grant that many \"Resolving Caliber\"."
          }
        },
        "Resonance Skill": {
          "skillName": "Fortified Defense",
          "skillDesc": "Taoqi deals Havoc DMG to surrounding targets, generating 3 Rocksteady Shield and healing herself. If attacked when casting Fortified Defense, Strategic Parry will be automatically cast.",
          "skillIcon": "Taoqi_ResonanceSkill.webp",
          "skillVars": {
            "Rocksteady Shield": "When the active character on the team is attacked, 1 Rocksteady Shield is consumed to reduce the damage taken."
          }
        },
        "Resonance Liberation": {
          "skillName": "Unmovable",
          "skillDesc": "Launch an attack based on Taoqi's DEF to the target, dealing Havoc DMG.",
          "skillIcon": "Taoqi_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Defense Formation",
          "skillDesc": "Attack the target, dealing Havoc DMG.",
          "skillIcon": "Taoqi_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Iron Will",
          "skillDesc": "The incoming Resonator (or Resonator on a nearby team that activates Outro Skill) has their Resonance Skill damage amplified by 38% for 14s or until they are switched off field.",
          "skillIcon": "Taoqi_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Steadfast Protection",
          "skillDesc": "While Resonance Skill Rocksteady Shield lasts, the Character's DEF is increased by 15%.",
          "skillIcon": "Taoqi_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Unyielding",
          "skillDesc": "After Heavy Attack Strategic Parry is successfully triggered, 25 Stamina is recovered.",
          "skillIcon": "Taoqi_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Essence of Tranquility": "Forte Circuit Power Shift's Shield is increased by 40%.",
        "Silent Strength": "The Crit. Rate and Crit. DMG of Resonance Liberation Unmovable is increased by 20% and 20%, respectively.",
        "Keen-eyed Observer": "The duration of Resonance Skill Rocksteady SHield is extended to 30s.",
        "Heavylifting Duty": "When Taoqi successfully triggers Heavy Attack Strategic Parry, she restores 25% HP and increases her DEF by 50% for 5s. This can be triggered once every 15s.",
        "Benevolent Guardian": "The damage of Forte Circuit Power Shift is increased by 50%. When Forte Circuit Power Shift hits a target, restore 20 Resonance Energy.",
        "Defender of Peace": "The damage of Taoqi's Basic Attack and Heavy Attack is increased by 40% while the Shield granted by Resonance Skill Rocksteady Shield holds."
      }
    },
    {
      "id": 13,
      "name": "Verina",
      "rarity": 5,
      "attribute": "Spectro",
      "weapon": "Rectifier",
      "profile": {
        "info": "With an extensive knowledge of botany, Verina is always solicitous, always smiling, and always wishing for every flower to be blessed with the miracle of life.",
        "gender": "Female",
        "birthplace": "New Federation",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "verina_icon.png",
        "portrait": "verina_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Cultivation",
          "skillDesc": "",
          "skillIcon": "Verina_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Verina performs up to 5 consecutive attacks with vines, dealing Spectro DMG.",
            "Heavy Attack": "Verina consumes STA to charge forward, dealing Spectro DMG.",
            "Mid-air Attack": "Verina consumes STA to perform up to 3 consecutive attacks in mid-air, dealing Spectro DMG.",
            "Mid-air Heavy Attack": "Hold Basic Attack to consume STA and perform a mid-air Plunging Attack, dealing Spectro DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Spectro DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Starflower Blooms",
          "skillDesc": "",
          "skillIcon": "Verina_ForteCircuit.webp",
          "skillVars": {
            "Heavy Attack: Starflower Blooms": "When casting Heavy Attack, if Verina carries \"Photosynthesis Energy\", Verina consumes 1 stack of \"Photosynthesis Energy\" to recover Concerto Energy and heal all characters on a nearby team. Heavy Attack: Starflower Blooms deals Spectro DMG, considered as Heavy Attack damage.",
            "Mid-air Attack: Starflower Blooms": "When casting Mid-air Attack, if Verina carries \"Photosynthesis Energy\", Verina consumes 1 stack of \"Photosynthesis Energy\" to recover Concerto Energy and heal all characters on a nearby team. Mid-air Attack: Starflower Blooms deals Spectro DMG, considered as Basic Attack damage. Verina can cast Mid-air Attack: Starflower Blooms by using Basic Attack after casting Heavy Attack: Starflower Blooms.",
            "Photosynthesis Energy": "Verina can hold up to 4 \"Photosynthesis Energy\".\n- Verina obtains 1 stack of \"Photosynthesis Energy\" for every Basic Attack 5 on hit;\n- Verina obtains 1 stack of \"Photosynthesis Energy\" for every Resonance Skill Botany Experiment on hit;\"- Verina obtains 1 stack of \"Photosynthesis Energy\" for every Intro Skill Verdant Growth on hit."
          }
        },
        "Resonance Skill": {
          "skillName": "Botany Experiment",
          "skillDesc": "Verina converges an energy field in front to grow foliage, dealing Spectro DMG within range.",
          "skillIcon": "Verina_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Arboreal Flourish",
          "skillDesc": "Verina nourishes nearby foliage at rapid speed, dealing Spectro DMG while healing all Characters on teams nearby. A Photosynthesis Mark is applied to the target on hit.",
          "skillIcon": "Verina_ResonanceLiberation.webp",
          "skillVars": {
            "Photosynthesis Mark": "Whenever a Character on a team nearby performs an attack on targets with a Photosynthesis Mark, Verina performs a Coordinated Attack, dealing Spectro DMG while healing the active Character dealing damage on a team nearby, triggered 1 time per second."
          }
        },
        "Intro Skill": {
          "skillName": "Verdant Growth",
          "skillDesc": "Verina attacks the target, dealing Spectro DMG.",
          "skillIcon": "Verina_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Blossom",
          "skillDesc": "Verina heals the incoming Resonator (or Resonator on a nearby team that activates this Outro Skill) by 19% of her ATK per second for 6s. All Resonators on a nearby team have their damage amplified by 15% for 30s.",
          "skillIcon": "Verina_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Gift of Nature",
          "skillDesc": "When Verina casts Heavy Attack Starflower Blooms, Mid-air Attack Starflower Blooms, Resonance Liberation Arboreal Flourish or Outro Skill Blossom, all team members' ATK are increased by 20% for 20s.",
          "skillIcon": "Verina_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Grace of Life",
          "skillDesc": "Verina protects a team member from fatal damage and grants a shield with strength equal to 120% of Verina's ATK, lasting for 10s. This can be triggered 1 time every 10 minutes.",
          "skillIcon": "Verina_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Moment of Emergence": "Outro Skill Blossom grants the next character a continuous Healing effect, recovering HP by 20% of Verina's ATK every 5s for 30s.",
        "Sprouting Reflections": "Resonance Skill Botany Experiment additionally grants 1 \"Photosynthesis Energy\" and 10 Concerto Energy.",
        "The Choice to Flourish": "Healing of Resonance Liberation's Photosynthesis Mark is increased by 12%.",
        "Blossoming Embrace": "Heavy Attack Starflower Blooms, Mid-air Attack Starflower Blooms, Resonance Liberation Arobreal Flourish and Outro Skill Blossom increases the Spectro DMG bonus of all team members by 15% for 24s.",
        "Miraculous Blooms": "When Verina heals a team member with HP less than 50%, her Healing is increased by 20%.",
        "Joyous Harvest": "Heavy Attack Starflower Blooms and Mid-air Attack Starflower Blooms deal 20% more damage. They will trigger Coordinated Attack 1 time and heal all characters nearby. The damage of this Coordinated Attack and the Healing are equal to those of the Resonance Liberation's Photosynthesis Mark."
      }
    },
    {
      "id": 14,
      "name": "Yangyang",
      "rarity": 4,
      "attribute": "Aero",
      "weapon": "Sword",
      "profile": {
        "info": "Yangyang is an Outrider of the Midnight Rangers. Once sheltered, now a fighter. She soars with the wind to protect others, like a skylark in flight.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "yangyang_icon.png",
        "portrait": "yangyang_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Feather as Blade",
          "skillDesc": "",
          "skillIcon": "Yangyang_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Yangyang performs up to 4 consecutive attacks, dealing Aero DMG.",
            "Heavy Attack": "Yangyang consumes STA to lunge forward, dealing Aero DMG.",
            "Heavy Attack: Zephyr Song": "Use Basic Attack after Heavy Attack or Dodge counter to perform Heavy Attack Zephyr Song, dealing Aero DMG.",
            "Mid-air Attack": "Yangyang consumes STA to perform a Plunging Attack from mid-air, dealing Aero DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to thrust forward, dealing Aero DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Echoing Feathers",
          "skillDesc": "",
          "skillIcon": "Yangyang_ForteCircuit.webp",
          "skillVars": {
            "Heavy Attack: Stormy Strike": "When Yangyang has 3 Melodies, she can cast Stormy Strike after Heavy Attack or Dodge Counter, dealing Aero DMG.",
            "Mid-air Attack: Feather Release": "When Yangyang has 3 Melodies, cast Basic Attack in mid-air to consume all Melodies and perform consecutive strikes, diving from wwww, dealing Aero DMG. As Yangyang lands, she sheathes her sword with an attack, dealing Aero DMG, considered as Basic Attack damage.",
            "Melody": "Yangyang can hold up to 3 Melodies.\n- Yangyang obtains 1 Melody with every Basic Attack 4 on hit.\n- Yangyang obtains 1 Melody for every Heavy Attack Zephyr Song on hit.\n- Yangyang obtains 1 Melody for every Resonance Skill Zephyr Domain on hit.\n- Yangyang obtains 1 Melody upon casting Intro Skill Cerulean Song."
          }
        },
        "Resonance Skill": {
          "skillName": "Zephyr Domain",
          "skillDesc": "Yangyang wields her sword to create a whirling vortex of winds that gathers nearby enemies to the center, dealing Aero DMG.",
          "skillIcon": "Yangyang_ResonanceSkill.webp",
          "skillVars": {}
        },
        "Resonance Liberation": {
          "skillName": "Wind Spirals",
          "skillDesc": "Yangyang conjures a mighty Cyclone that gathers nearby enemies, dealing Aero DMG.",
          "skillIcon": "Yangyang_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Cerulean Song",
          "skillDesc": "Yangyang sends the target into the air, dealing Aero DMG.",
          "skillIcon": "Yangyang_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Whispering Breeze",
          "skillDesc": "Yangyang recovers 4 Resonance Energy per second over 5s for the incoming character (or a character on a nearby team that activates an Outro Skill).",
          "skillIcon": "Yangyang_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Compassion",
          "skillDesc": "Yangyang recovers 30 STA after she casts a Mid-air Attack Feather Release.",
          "skillIcon": "Yangyang_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Lazuline Mercy",
          "skillDesc": "Yangyang's Aero DMG bonus is increased by 8% for 8s after casting Intro Skill Cerulean Song.",
          "skillIcon": "InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Sapphire Skies, Soaring Sparrows": "Intro Skill Cerulean Song increases Yangyang's Aero DMG bonus by an additional 15% for 8s.",
        "Nesting Twigs, in Beaks They Harrow": "Heavy Attack recovers an additional 10 Resonance Energy for Yangyang when it hits a target, which can be triggered 1 time every 20s.",
        "Nature Sings in Symphony": "Resonance Skill damage bonus is increased by 40%. The Wind Field's pulling effect on surrounding targets is enhanced, and the pulling range is expanded by 33%.",
        "Close Your Eyes and Listen in": "Mid-air Attack Feather Release's damage is increased by 95%.",
        "Winds Whisper in Harmony": "Resonance Liberation Wind Spirals' damage is increased by 85%.",
        "A Tribute to Life's Sweet Hymn": "After casting Mid-air Attack Feather Release, the ATK of all team members is increased by 20% for 20s."
      }
    },
    {
      "id": 17,
      "name": "Yinlin",
      "rarity": 5,
      "attribute": "Electro",
      "weapon": "Rectifier",
      "profile": {
        "info": "Yinlin is a skilled Patroller and powerful Natural Resonator. After being suspended from her duties at the Public Security Bureau, she must now pursue hidden evils in secrecy.",
        "gender": "Female",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "yinlin_icon.png",
        "portrait": "yinlin_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Zapstring's Dance",
          "skillDesc": "",
          "skillIcon": "Yinlin_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Yinlin controls the puppet \"Zapstring\" to perform up to 4 attacks, dealing Electro DMG.",
            "Heavy Attack": "Yinlin consumes STA to control \"Zapstring\", dealing Electro DMG.",
            "Mid-air Attack": "Yinlin consumes STA to control \"Zapstring\" to perform a Mid-air Plunging Attack, dealing Electro DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Electro DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Chameleon Cipher",
          "skillDesc": "",
          "skillIcon": "Yinlin_ForteCircuit.webp",
          "skillVars": {
            "Chameleon Cipher": "When Yinlin's \"Judgement Points\" is full, her Heavy Attack is replaced with Chameleon Cipher, which consumes all \"Judgement Points\" to attack the target, dealing Electro DMG. When it hits a target marked with Sinner's Mark, the Sinner's Mark is replaced with Punishment Mark, lasting for 18s.",
            "Sinner's Mark": "Basic Attack Zapstring's Dance, Resonance Liberation Thundering Wrath, and Intro Skill Roaring Storm will apply Sinner's Mark on hit. Sinner's Mark is removed when Yinlin exits.",
            "\"Punishment Mark\"": "When a target marked with Punishment Mark is damaged, Judgement Strike will fall, dealing Electro DMG to all targets marked with Punishment Mark. This can be triggered up to once per second.",
            "Judgement Points": "Yinlin can hold up to 100 Judgement Points.\n- When Normal attack Zapstring's Dance hits a target, restore \"Judgement Points\".\n- When casting Resonance Skill Magnetic Roar hits a target, restore \"Judgement Points\".\n- When Resonance Skill Electromagnetic Blast hits a target, restores \"Judgement Points\".\n- When casting Resonance Skill Magnetic Roar hits a target, restore \"Judgement Points\"."
          }
        },
        "Resonance Skill": {
          "skillName": "Magnetic Roar",
          "skillDesc": "",
          "skillIcon": "Yinlin_ResonanceSkill.webp",
          "skillVars": {
            "Magnetic Roar": "The puppet \"Zapstring\" deals Electro DMG to the target, and puts Yinlin in Resonance Skill Execution Mode.",
            "Execution Mode": "Basic Attack and Dodge Counter will trigger 1 Electromagnetic Blast when hitting a target. Each stage of Basic Attack or Dodge Counter can only trigger 1 Electromagnetic Blast, up to 4 times.",
            "Electromagnetic Blast": "Attack all targets marked with Forte Circuit Sinner's Mark, dealing Electro DMG.",
            "Lightning Execution": "Use Resonance Skill after casting Resonance Skill Magnetic Roar to cast Lightning Execution to attack the target, dealing electro DMG. If Resonance Skill Lightning Execution is not activated in a while or this Character is switched, this Skill will be put on Cooldown."
          }
        },
        "Resonance Liberation": {
          "skillName": "Thundering Wrath",
          "skillDesc": "Command \"Zapstring\" to call for thunder to fall upon a large range, dealing Electro DMG.",
          "skillIcon": "Yinlin_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Raging Storm",
          "skillDesc": "Command puppet \"Zapstring to attack, dealing Electro DMG in a large range.",
          "skillIcon": "Yinlin_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Strategist",
          "skillDesc": "The incoming Resonator (or Resonator on a nearby team that activates Outro Skill) has their Electro DMG amplified by 20% and Resonance Liberation damage amplified by 25% for 14s or until they are switched off field.",
          "skillIcon": "Yinlin_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Pain Immersion",
          "skillDesc": "After using Resonance Skill Magnetic Roar, Yinlin's Crit. Rate is increased by 15% for 5s.",
          "skillIcon": "Yinlin_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Deadly Focus",
          "skillDesc": "The damage of Resonance Skill Lightning Execution is increased by 10% when hitting targets marked with Sinner's Mark, and Yinlin's ATK is increased by 10% for 4s when this is triggered.",
          "skillIcon": "Yinlin_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Morality's Crossroads": "Resonance Skill Magnetic Roar and Lightning Execution deal 70% more damage.",
        "Ensnarled by Rapport": "Resonance Skill Electromagnetic Blast recovers an additional 5 \"Judgement Point(s)\" and 5 Resonance Energy on hit.",
        "Unyielding Verdict": "Forte Circuit Judgement Strike's damage multiplier is increased by 55%.",
        "Steadfast Conviction": "When Forte Circuit Judgement Strike hits a target, the ATK of all team members is increased by 20% for 12s.",
        "Resounding Will": "Resonance Liberation Thundering Wrath deals 100% extra damage to targets with Forte Circuit's Sinner's Mark or Punishment Mark.",
        "Pursuit of Justice": "In the first 30s after casting Resonance Liberation Thundering Wrath, when Yinlin's Basic Attack hits a target, Furious Thunder will be triggered, dealing Electro DMG equal to 419.59% of Yinlin's ATK. Every Basic Attack hit can trigger Furious Thunder 1 time, up to 4 times. This is considered Resonance Skill damage."
      }
    },
    {
      "id": 15,
      "name": "Yuanwu",
      "rarity": 4,
      "attribute": "Electro",
      "weapon": "Gauntlet",
      "profile": {
        "info": "Yuanwu owns a boxing gym where he teaches martial arts and health management. He is well-respected in the community for his cordial demeanor and pleasant temperament.",
        "gender": "Male",
        "birthplace": "Huanglong",
        "affiliation": "Jinzhou"
      },
      "image": {
        "icon": "yuanwu_icon.png",
        "portrait": "yuanwu_portrait.png"
      },
      "skills": {
        "Normal Attack": {
          "skillName": "Leihuangquan",
          "skillDesc": "",
          "skillIcon": "Yuanwu_NormalAttack.webp",
          "skillVars": {
            "Basic Attack": "Yuanwu performs up to 5 consecutive attacks, dealing Electro DMG.",
            "Heavy Attack": "Yuanwu consumes STA to attack the target, dealing Electro DMG.",
            "Mid-air Attack": "Yuanwu consumes STA to launch a Mid-air Plunging Attack, dealing Electro DMG.",
            "Dodge Counter": "Use Basic Attack after a successful Dodge to attack the target, dealing Electro DMG."
          }
        },
        "Forte Circuit": {
          "skillName": "Unassuming Blade",
          "skillDesc": "",
          "skillIcon": "Yuanwu_ForteCircuit.webp",
          "skillVars": {
            "Rumbling Spark": "When \"Readiness\" is full, long press Resonance Skill to consume all \"Readiness\" and cast Rumbling Spark, dealing Electro DMG and entering the Lightning Infused state.",
            "Thunder Uprising": "When \"Readiness\" is full, Resonance Skill Thunder Wedge will be replaced with Thunder Uprising, dealing Electro DMG.",
            "Lightning Infused": "The character in Lightning Infused state has a greatly increased resistance to interruption. When Yuanwu is in this state:\n- Basic Attacks: Hits targets in a larger range, reduce enemy Vibration Strength with increased efficiency;\n- Heavy Attacks: Have increased attack speed, reduce enemy Vibration Strength with increased efficiency;\n- Dodge Counters: Have increased attack speed, reduce enemy Vibration Strength with increased efficiency.\n- Use Basic Attack within 3s after casting a Heavy Attack or a successful Counterattack to cast Thunderweaver, dealing Electro DMG, considered as Basic Attack damage;\n- Does not recover \"Readiness\".",
            "Readiness": "Yuanwu can hold up to 100 \"Readiness\".\n- When Resonance Skill Thunder Wedge is on the field, Yuanwu gains 6 \"Readiness\" every second, even when he is not the active character;\n- When Resonance Skill Thunder Wedge hits a target with a Coordinated Attack, Yuanwu gains 5 \"Readiness\"."
          }
        },
        "Resonance Skill": {
          "skillName": "Leihuang Master",
          "skillDesc": "",
          "skillIcon": "Yuanwu_ResonanceSkill.webp",
          "skillVars": {
            "Thunder Wedge": "Yuanwu summons Thunder Wedge, dealing Electro DMG, and forms a Thunder Field centered on the Thunder Wedge. Thunder Wedge lasts for 12s. Forte Circuit Rumbling Spark and Resonance Liberation Blazing Might will immediately detonate Resonance Skill Thunder Wedge on the field, dealing Electro DMG, considered as Resonance Skill damage.",
            "Thunder Field": "The active character gains the effects below when in the Thunder Field:\n- A Coordinated Attack from Resonance Skill Thunder Wedge is triggered when attacks hit a target, dealing Electro DMG.\n- This can be triggered once every 1.2s.\n- The effect lasts for 1.5s."
          }
        },
        "Resonance Liberation": {
          "skillName": "Blazing Might",
          "skillDesc": "Awaken the power of thunder and provide Forte Circuit Lightning Infused status to all characters on a nearby team for 10s, then perform a powerful blow that deals Electro DMG.",
          "skillIcon": "Yuanwu_ResonanceLiberation.webp",
          "skillVars": {}
        },
        "Intro Skill": {
          "skillName": "Thunder Bombardment",
          "skillDesc": "Attack the target, dealing Electro DMG.",
          "skillIcon": "Yuanwu_IntroSkill.webp",
          "skillVars": {}
        },
        "Outro Skill": {
          "skillName": "Lightning Manipulation",
          "skillDesc": "Yuanwu unleashes thunderbolts in an area centered around the skill target, greatly reducing the Vibration Strength of enemies upon impact.",
          "skillIcon": "Yuanwu_OutroSkill.webp",
          "skillVars": {}
        },
        "Inherent Skill 1": {
          "skillName": "Thunderous Determination",
          "skillDesc": "The damage multiplier of Resonance Skill Thunder Uprising is increased by 40%, and its reduction efficiency of enemy Vibration Strength is enhanced.",
          "skillIcon": "Yuanwu_InherentSkill1.webp",
          "skillVars": {}
        },
        "Inherent Skill 2": {
          "skillName": "Reserved Confidence",
          "skillDesc": "The ranges of the Resonance Skills Thunder Field and Thunder Uprising are greatly expanded. When exiting during combat, if \"Readiness\" is not full, Yuanwu will automatically leave 1 Resonance Skill Thunder Wedge in place.",
          "skillIcon": "Yuanwu_InherentSkill2.webp",
          "skillVars": {}
        }
      },
      "resonanceChain": {
        "Steaming Cup of Justice": "When Yuanwu is in Forte Circuit's Lightning Infused state, his Basic Attack Speed is increased by 20%, and his Heavy Attack Speed is increased by 20%.",
        "Fire Heart, Serene Mind": "Intro Skill Thunder Bombardment additionally recovers 15 Resonance Energy for Yuanwu.",
        "Upholder of Integrity": "When the Coordinated Attacks of Resonance Skill's Thunder Wedge hits a target, the damage is additionally increased by 20% of Yuanwu's DEF.",
        "Retributive Knuckles": "When casting Resonance Liberation Blazing Might, the on-field character will gain a Shield equal to 200% of Yuanwu's DEF for 10s.",
        "Neighborhood Protector": "When Resonance Skill Thunder Wedge is on the field, Yuanwu's Resonance Liberation damage bonus is increased by 50%.",
        "Defender of All Realms": "All team members nearby within the range of Resonance Skill Thunder Wedge will gain a 32% DEF increased, lasting 3s."
      }
    }
  ]
}
